MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_rcc.c
  * @brief   RCC HAL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (RCC)
#if defined(USE_HAL_RCC_MODULE) && (USE_HAL_RCC_MODULE == 1)
/** @defgroup RCC RCC
  * @{
  */
/** @defgroup RCC_Introduction RCC Introduction
  * @{

  - The RCC (Reset and Clock Control) Hardware Abstraction Layer (HAL) provides a comprehensive set of APIs to
    interface with the STM32C5xx RCC peripheral.
  - It simplifies the configuration, initialization and management of system and peripheral clocks, reset control,
    and privilege attributes.
  - The driver supports multiple oscillators (HSI, PSI, HSE, LSE, LSI).
    HSI oscillator is split into three independent clock outputs: HSIS, HSIDIV3, and HSIK.
    PSI oscillator is split into three independent clock outputs: PSIS, PSIDIV3, and PSIK.
  - Key features include configuration of all bus prescalers, highly flexible peripheral kernel clock control,
    clock security system management (CSS), low-power clock gating and system reset to default states.
  - Peripheral clock management APIs allow enabling, disabling, and resetting clocks on various buses (AHB, APB)
    with fine-grained control.
  - Privileged access levels attributes management functions allow configuration of privileged
    and public access rights to RCC resources.
  - The HAL RCC driver ensures some degree of portability and consistent behavior across STM32C5xx microcontroller
    series for common features, facilitating robust, privilege, and power-efficient clock and reset management in
    diverse embedded applications.

  */
/**
  * @}
  */

/** @defgroup RCC_How_To_Use RCC How To Use
  * @{

This file provides firmware functions to manage the following
functionalities of the Reset and Clock Control (RCC) peripheral:

- Configuration and reset functions
- Oscillators and Peripherals Control functions
- Bus configuration functions

Main APIs are not allowed to perform any other actions than their main objective (for instance, it is not allowed to
disable a PSI or an oscillator inside an enable function).

For performance reasons, few functionalities are not supported by the HAL driver but these functionalities are covered
by the LL driver (for instance, interrupt management).

If the system clock is dynamically changed during runtime by the application or example code, it must call
HAL_UpdateCoreClock() (a HAL generic driver function) at the end of the change to update SystemCoreClock and the
systick (used by CMSIS) accordingly. The driver updates the SystemCoreClock variable and systick only in the
HAL_RCC_Reset() and HAL_RCC_ResetSystemClock() functions.

## RCC specific features

After exiting from standby or reset, the device is running from High Speed Internal Divided by 3 (HSIDIV3)
oscillator (by default to 48MHz).

- There is no prescaler on High speed (AHBs) and Low speed (APBs) buses:
all peripherals mapped on these buses are running at sysclk frequency.
- The clock for all peripherals is switched off, except the SRAM and FLASH.

Once the device started from reset, the application can:

- Configure the clock source to be used to drive the System clock
(if the application needs higher frequency/performance)
- Configure the System clock frequency and Flash settings
- Configure the AHB and APB buses prescalers
- Enable the clock for the peripheral(s) to be used
- Configure the clock source(s) for peripherals whose clocks receive an independent kernel clocks.
- Configure peripherals supporting the low power mode (These peripherals are able to generate a kernel clock
request and a AHB/APB bus clock request when they need, in order to operate and update their status register
even in Stop mode).
- Get the clock frequency of peripherals whose clocks receive independent kernel clocks.
  */
/**
  * @}
  */

/** @defgroup RCC_Configuration_Table RCC Configuration Table
  * @{
## Configuration inside the RCC driver

Config defines            | Description               | Default value | Note
------------------------- | ------------------------- | ------------- | ------------------------------------
PRODUCT                   | from IDE                  | Defined       | The selected product (ex STM32C562xx)
PERIPHERAL                | from CMSIS                | Defined       | Peripheral available on the selected product
USE_ASSERT_DBG_PARAM      | from IDE                  | None          | When defined, enable the params assert
USE_HAL_CHECK_PARAM       | from hal_conf.h           | 0             | When set, parameters are checked in runtime
USE_HAL_RCC_MODULE        | from hal_conf.h           | 1             | When set, HAL RCC module is enabled
USE_EXTERNAL_ENV          | from IDE                  | Defined       | When set, ext. oscillators values are defined
LSE_VALUE                 | From stm32_external_env.h | 32 KHz        | Frequency of LSE oscillator (USE_EXTERNAL_ENV)
HSE_VALUE                 | From stm32_external_env.h | 24 or 48 MHz  | Frequency of HSE oscillator (USE_EXTERNAL_ENV)
HSI_VALUE                 | st32c5xxxx.h              | 144 MHz       | Frequency of HSI oscillator
HSI48_VALUE               | st32c5xxxx.h              | 48 MHz        | Frequency of HSI48 oscillator
HSI_RESET_VALUE           | st32c5xxxx.h              | 48 MHz        | Frequency of system core clock after reset
USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT   | from hal_conf.h  | 0    | When set, RCC peripherals configuration reset
USE_HAL_RCC_RESET_RTC_DOMAIN                | from hal_conf.h  | 0    | When set, Resources under backup domain reset
  *
  */
/**
  * @}
  */


/* Private typedef -----------------------------------------------------------*/
/** @defgroup RCC_Private_Typedef RCC Private Type definition
  * @{
  */
typedef  uint32_t (*rcc_cb_timeout_t)(void); /*!< RCC internal Callback pointer definition */
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants and enumerations
  * @{
  */

/**
  * @brief Timeout values.
  */
#if defined(HSE_VALUE)
#define RCC_HSE_TIMEOUT_VALUE         HSE_STARTUP_TIMEOUT /*!< HSE Timeout value                                */
#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
#define RCC_LSE_TIMEOUT_VALUE         LSE_STARTUP_TIMEOUT /*!< LSE Timeout value                                */
#endif /* LSE_VALUE */
#define RCC_LSI_TIMEOUT_VALUE         ((20u * 128u * 1000u) / LSI_VALUE) /*!< 80 ms for LSI at 32KHz            */
#define RCC_HSI_TIMEOUT_VALUE         2UL    /*!< 2 ms (minimum Tick + 1)                                       */
#define RCC_PSI_TIMEOUT_VALUE         2UL    /*!< 2 ms (minimum Tick + 1)                                       */
#define RCC_CLOCKSWITCH_TIMEOUT_VALUE 5000UL /*!< 5 s                                                           */

/**
  * @brief PSI Output values.
  */
#define PSI_LSE_100 100016000U     /*!< PSI output frequency not exactly 100 MHz with LSE as PSI clock source */
#define PSI_LSE_144 144015000U     /*!< PSI output frequency not exactly 144 MHz with LSE as PSI clock source */
#define PSI_LSE_160 160006000U     /*!< PSI output frequency not exactly 160 MHz with LSE as PSI clock source */
#define PSI_NOT_LSE_100 100000000U /*!< PSI output frequency exactly 100 MHz without LSE as PSI clock source  */
#define PSI_NOT_LSE_144 144000000U /*!< PSI output frequency exactly 144 MHz without LSE as PSI clock source  */
#define PSI_NOT_LSE_160 160000000U /*!< PSI output frequency exactly 160 MHz without LSE as PSI clock source  */

/**
  * @}
  */

