MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
/* Private macros ------------------------------------------------------------*/
/** @defgroup RCC_Private_Macros RCC Private Macros
  * @{
  */
#if defined(HSE_VALUE)
/*! Macro to check HSE mode */
#define IS_RCC_HSE_MODE_ENABLE(mode)  (((mode) == HAL_RCC_HSE_ON)                  \
                                       || ((mode) == HAL_RCC_HSE_BYPASS)           \
                                       ||((mode) == HAL_RCC_HSE_BYPASS_DIGITAL))

#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
/*! Macro to check LSE mode */
#define IS_RCC_LSE_MODE_ENABLE(mode)  (((mode) == HAL_RCC_LSE_ON)                  \
                                       || ((mode) == HAL_RCC_LSE_BYPASS)           \
                                       || ((mode) == HAL_RCC_LSE_BYPASS_DIGITAL))

/*! Macro to check LSE drive */
#define IS_RCC_LSE_DRIVE(drive) (((drive) == HAL_RCC_LSE_DRIVE_LOW)                \
                                 || ((drive) == HAL_RCC_LSE_DRIVE_MEDIUMLOW)       \
                                 || ((drive) == HAL_RCC_LSE_DRIVE_MEDIUMHIGH)      \
                                 || ((drive) == HAL_RCC_LSE_DRIVE_HIGH))

#endif /* LSE_VALUE */
/*! Macro to check HSIS state */
#define IS_RCC_HSIS(hsi) (((hsi) == HAL_RCC_HSIS_OFF) || ((hsi) == HAL_RCC_HSIS_ON))

/*! Macro to check HSIDIV3 state */
#define IS_RCC_HSIDIV3(hsi)  (((hsi) == HAL_RCC_HSIDIV3_OFF) || ((hsi) == HAL_RCC_HSIDIV3_ON))

/*! Macro to check HSIK state */
#define IS_RCC_HSIK(hsi)  (((hsi) == HAL_RCC_HSIK_OFF) || ((hsi) == HAL_RCC_HSIK_ON))

/*! Macro to check HSIK divider */
#define IS_RCC_HSIKDIV(div) (((div) == HAL_RCC_HSIK_DIV1) || ((div) == HAL_RCC_HSIK_DIV1_5)       \
                             || ((div) == HAL_RCC_HSIK_DIV2) || ((div) == HAL_RCC_HSIK_DIV2_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV3) || ((div) == HAL_RCC_HSIK_DIV3_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV4) || ((div) == HAL_RCC_HSIK_DIV4_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV5) || ((div) == HAL_RCC_HSIK_DIV5_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV6) || ((div) == HAL_RCC_HSIK_DIV6_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV7) || ((div) == HAL_RCC_HSIK_DIV7_5)    \
                             || ((div) == HAL_RCC_HSIK_DIV8))

/*! Macro to check PSIS state */
#define IS_RCC_PSIS(psi)  (((psi) == HAL_RCC_PSIS_OFF) || ((psi) == HAL_RCC_PSIS_ON))

/*! Macro to check PSIDIV3 state */
#define IS_RCC_PSIDIV3(psi)  (((psi) == HAL_RCC_PSIDIV3_OFF) || ((psi) == HAL_RCC_PSIDIV3_ON))

/*! Macro to check PSIK state */
#define IS_RCC_PSIK(psi)  (((psi) == HAL_RCC_PSIK_OFF) || ((psi) == HAL_RCC_PSIK_ON))

/*! Macro to check PSIK divider */
#define IS_RCC_PSIKDIV(div) (((div) == HAL_RCC_PSIK_DIV1) || ((div) == HAL_RCC_PSIK_DIV1_5)       \
                             || ((div) == HAL_RCC_PSIK_DIV2) || ((div) == HAL_RCC_PSIK_DIV2_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV3) || ((div) == HAL_RCC_PSIK_DIV3_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV4) || ((div) == HAL_RCC_PSIK_DIV4_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV5) || ((div) == HAL_RCC_PSIK_DIV5_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV6) || ((div) == HAL_RCC_PSIK_DIV6_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV7) || ((div) == HAL_RCC_PSIK_DIV7_5)    \
                             || ((div) == HAL_RCC_PSIK_DIV8))

/*! Macro to check PSI source */
#define IS_RCC_PSISOURCE(src) (((src) == HAL_RCC_PSI_SRC_HSE) || ((src) == HAL_RCC_PSI_SRC_LSE) \
                               || ((src) == HAL_RCC_PSI_SRC_HSI_8MHz))

/*! Macro to check PSI input reference frequency */
#define IS_RCC_PSIREF(ref) (((ref) == HAL_RCC_PSI_REF_32768HZ) || ((ref) == HAL_RCC_PSI_REF_8MHZ)   \
                            || ((ref) == HAL_RCC_PSI_REF_16MHZ) || ((ref) == HAL_RCC_PSI_REF_24MHZ) \
                            || ((ref) == HAL_RCC_PSI_REF_25MHZ) || ((ref) == HAL_RCC_PSI_REF_32MHZ) \
                            || ((ref) == HAL_RCC_PSI_REF_48MHZ) || ((ref) == HAL_RCC_PSI_REF_50MHZ))

/*! Macro to check PSI output frequency */
#define IS_RCC_PSIOUT(out) (((out) == HAL_RCC_PSI_OUT_100MHZ) || ((out) == HAL_RCC_PSI_OUT_144MHZ)  \
                            || ((out) == HAL_RCC_PSI_OUT_160MHZ))

/*! Macro to check LSI state */
#define IS_RCC_LSI(lsi)  (((lsi) == HAL_RCC_LSI_OFF) || ((lsi) == HAL_RCC_LSI_ON))

/*! Macro to check RCC item attributes */
#define IS_RCC_ITEM_ATTRIBUTES(item) ((0U < (item)) && ((item) <= 0x1FFFU))

/*! Macro to check RCC stop wakeup clock */
#define IS_RCC_STOP_WAKEUPCLOCK(source) (((source) == HAL_RCC_STOP_WAKEUPCLOCK_HSIDIV3)        \
                                         || ((source) == HAL_RCC_STOP_WAKEUPCLOCK_HSIS))

/*! Macro to check RCC system clock */
#define IS_RCC_SYSCLKSOURCE(source) (((source) == HAL_RCC_SYSCLK_SRC_HSIS)        \
                                     || ((source) == HAL_RCC_SYSCLK_SRC_HSIDIV3)  \
                                     || ((source) == HAL_RCC_SYSCLK_SRC_HSE)      \
                                     || ((source) == HAL_RCC_SYSCLK_SRC_PSIS))

/*! Macro to check HCLK prescaler */
#define IS_RCC_HCLK(hclk) (((hclk) == HAL_RCC_HCLK_PRESCALER1) || ((hclk) == HAL_RCC_HCLK_PRESCALER2)        \
                           || ((hclk) == HAL_RCC_HCLK_PRESCALER4) || ((hclk) == HAL_RCC_HCLK_PRESCALER8)     \
                           || ((hclk) == HAL_RCC_HCLK_PRESCALER16) || ((hclk) == HAL_RCC_HCLK_PRESCALER64)   \
                           || ((hclk) == HAL_RCC_HCLK_PRESCALER128) || ((hclk) == HAL_RCC_HCLK_PRESCALER256) \
                           || ((hclk) == HAL_RCC_HCLK_PRESCALER512))

/*! Macro to check PCLK prescaler */
#define IS_RCC_PCLK(pclk) (((pclk) == HAL_RCC_PCLK_PRESCALER1) || ((pclk) == HAL_RCC_PCLK_PRESCALER2)        \
                           || ((pclk) == HAL_RCC_PCLK_PRESCALER4) || ((pclk) == HAL_RCC_PCLK_PRESCALER8)     \
                           || ((pclk) == HAL_RCC_PCLK_PRESCALER16))

/*! Macro to check MCO clock source */
#define IS_RCC_MCOSOURCE(source)  (((source) == HAL_RCC_MCO1_SRC_SYSCLK)      \
                                   || ((source) == HAL_RCC_MCO1_SRC_HSE)      \
                                   || ((source) == HAL_RCC_MCO1_SRC_LSE)      \
                                   || ((source) == HAL_RCC_MCO1_SRC_LSI)      \
                                   || ((source) == HAL_RCC_MCO1_SRC_PSIK)     \
                                   || ((source) == HAL_RCC_MCO1_SRC_HSIK)     \
                                   || ((source) == HAL_RCC_MCO1_SRC_PSIS)     \
                                   || ((source) == HAL_RCC_MCO1_SRC_HSIS)     \
                                   || ((source) == HAL_RCC_MCO2_SRC_SYSCLK)   \
                                   || ((source) == HAL_RCC_MCO2_SRC_HSE)      \
                                   || ((source) == HAL_RCC_MCO2_SRC_LSE)      \
                                   || ((source) == HAL_RCC_MCO2_SRC_LSI)      \
                                   || ((source) == HAL_RCC_MCO2_SRC_PSIK)     \
                                   || ((source) == HAL_RCC_MCO2_SRC_HSIK)     \
                                   || ((source) == HAL_RCC_MCO2_SRC_PSIDIV3)  \
                                   || ((source) == HAL_RCC_MCO2_SRC_HSIDIV3))

/*! Macro to check MCO divider */
#define IS_RCC_MCOPRE(div) (((div) == HAL_RCC_MCO1_NO_CLK) || ((div) == HAL_RCC_MCO1_PRESCALER1)     \
                            || ((div) == HAL_RCC_MCO1_PRESCALER2) || ((div) == HAL_RCC_MCO1_PRESCALER3)    \
                            || ((div) == HAL_RCC_MCO1_PRESCALER4) || ((div) == HAL_RCC_MCO1_PRESCALER5)    \
                            || ((div) == HAL_RCC_MCO1_PRESCALER6) || ((div) == HAL_RCC_MCO1_PRESCALER7)    \
                            || ((div) == HAL_RCC_MCO1_PRESCALER8) || ((div) == HAL_RCC_MCO1_PRESCALER9)    \
                            || ((div) == HAL_RCC_MCO1_PRESCALER10) || ((div) == HAL_RCC_MCO1_PRESCALER11)  \
                            || ((div) == HAL_RCC_MCO1_PRESCALER12) || ((div) == HAL_RCC_MCO1_PRESCALER13)  \
                            || ((div) == HAL_RCC_MCO1_PRESCALER14) || ((div) == HAL_RCC_MCO1_PRESCALER15)  \
                            || ((div) == HAL_RCC_MCO2_NO_CLK) || ((div) == HAL_RCC_MCO2_PRESCALER1)  \
                            || ((div) == HAL_RCC_MCO2_PRESCALER2) || ((div) == HAL_RCC_MCO2_PRESCALER3)    \
                            || ((div) == HAL_RCC_MCO2_PRESCALER4) || ((div) == HAL_RCC_MCO2_PRESCALER5)    \
                            || ((div) == HAL_RCC_MCO2_PRESCALER6) || ((div) == HAL_RCC_MCO2_PRESCALER7)    \
                            || ((div) == HAL_RCC_MCO2_PRESCALER8) || ((div) == HAL_RCC_MCO2_PRESCALER9)    \
                            || ((div) == HAL_RCC_MCO2_PRESCALER10) || ((div) == HAL_RCC_MCO2_PRESCALER11)  \
                            || ((div) == HAL_RCC_MCO2_PRESCALER12) || ((div) == HAL_RCC_MCO2_PRESCALER13)  \
                            || ((div) == HAL_RCC_MCO2_PRESCALER14) || ((div) == HAL_RCC_MCO2_PRESCALER15))

/*! Macro to check LSCO clock source */
#define IS_RCC_LSCOSOURCE(source) (((source) == HAL_RCC_LSCO_SRC_LSI)     \
                                   || ((source) == HAL_RCC_LSCO_SRC_LSE))


/*! Macro to check the privileged attribute selection */
#define IS_RCC_PRIV_ATTR(attribute) ((attribute == HAL_RCC_PRIV  )    \
                                     || (attribute == HAL_RCC_NPRIV))

/*! Macro to check the privileged attribute selected item */
#define IS_RCC_PRIV_ITEM(item) ((((item) & (HAL_RCC_PRIV_ITEM_ALL)) != 0x00U)      \
                                && (((item) & ~(HAL_RCC_PRIV_ITEM_ALL)) == 0x00U))

/*! Macro to check USART1 clock source */
#define IS_RCC_USART1_CLK(source)                  \
  (((source) == HAL_RCC_USART1_CLK_SRC_PCLK2)      \
   || ((source) == HAL_RCC_USART1_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_USART1_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_USART1_CLK_SRC_LSE))

/*! Macro to check USART2 clock source */
#define IS_RCC_USART2_CLK(source)                  \
  (((source) == HAL_RCC_USART2_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_USART2_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_USART2_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_USART2_CLK_SRC_LSE))
#if defined(USART3)

/*! Macro to check USART3 clock source */
#define IS_RCC_USART3_CLK(source)                  \
  (((source) == HAL_RCC_USART3_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_USART3_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_USART3_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_USART3_CLK_SRC_LSE))
#endif /* USART3 */

/*! Macro to check UART4 clock source */
#define IS_RCC_UART4_CLK(source)                  \
  (((source) == HAL_RCC_UART4_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_UART4_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_UART4_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_UART4_CLK_SRC_LSE))

/*! Macro to check UART5 clock source */
#define IS_RCC_UART5_CLK(source)                  \
  (((source) == HAL_RCC_UART5_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_UART5_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_UART5_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_UART5_CLK_SRC_LSE))
#if defined(USART6)

/*! Macro to check USART6 clock source */
#define IS_RCC_USART6_CLK(source)                 \
  (((source) == HAL_RCC_USART6_CLK_SRC_PCLK1)     \
   || ((source) == HAL_RCC_USART6_CLK_SRC_PSIK)   \
   || ((source) == HAL_RCC_USART6_CLK_SRC_HSIK)   \
   || ((source) == HAL_RCC_USART6_CLK_SRC_LSE))
#endif /* USART6 */
#if defined(UART7)

/*! Macro to check UART7 clock source */
#define IS_RCC_UART7_CLK(source)                  \
  (((source) == HAL_RCC_UART7_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_UART7_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_UART7_CLK_SRC_HSIK)    \
   || ((source) == HAL_RCC_UART7_CLK_SRC_LSE))
#endif /* UART7 */

