MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
/*! Macro to check LPUART1 clock source */
#define IS_RCC_LPUART1_CLK(source)                \
  (((source) == HAL_RCC_LPUART1_CLK_SRC_PCLK3)    \
   || ((source) == HAL_RCC_LPUART1_CLK_SRC_HSIK)  \
   || ((source) == HAL_RCC_LPUART1_CLK_SRC_LSE)   \
   || ((source) == HAL_RCC_LPUART1_CLK_SRC_LSI))

/*! Macro to check SPI1 clock source */
#define IS_RCC_SPI1_CLK(source)                   \
  (((source) == HAL_RCC_SPI1_CLK_SRC_PCLK2)       \
   || ((source) == HAL_RCC_SPI1_CLK_SRC_PSIK)     \
   || ((source) == HAL_RCC_SPI1_CLK_SRC_HSIK)     \
   || ((source) == HAL_RCC_SPI1_CLK_SRC_AUDIOCLK))

/*! Macro to check SPI2 clock source */
#define IS_RCC_SPI2_CLK(source)                   \
  (((source) == HAL_RCC_SPI2_CLK_SRC_PCLK1)       \
   || ((source) == HAL_RCC_SPI2_CLK_SRC_PSIK)     \
   || ((source) == HAL_RCC_SPI2_CLK_SRC_HSIK)     \
   || ((source) == HAL_RCC_SPI2_CLK_SRC_AUDIOCLK))
#if defined(SPI3)

/*! Macro to check SPI3 clock source */
#define IS_RCC_SPI3_CLK(source)                   \
  (((source) == HAL_RCC_SPI3_CLK_SRC_PCLK1)       \
   || ((source) == HAL_RCC_SPI3_CLK_SRC_PSIK)     \
   || ((source) == HAL_RCC_SPI3_CLK_SRC_HSIK)     \
   || ((source) == HAL_RCC_SPI3_CLK_SRC_AUDIOCLK))
#endif /* SPI3 */
#if defined(FDCAN1)

/*! Macro to check FDCAN clock source */
#define IS_RCC_FDCAN_CLK(source)                  \
  (((source) == HAL_RCC_FDCAN_CLK_SRC_PCLK1)      \
   || ((source) == HAL_RCC_FDCAN_CLK_SRC_PSIS)    \
   || ((source) == HAL_RCC_FDCAN_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_FDCAN_CLK_SRC_HSE))
#endif /* FDCAN1 */

/*! Macro to check I2C1 clock source */
#define IS_RCC_I2C1_CLK(source)                   \
  (((source) == HAL_RCC_I2C1_CLK_SRC_PCLK1)       \
   || ((source) == HAL_RCC_I2C1_CLK_SRC_PSIK)     \
   || ((source) == HAL_RCC_I2C1_CLK_SRC_HSIK))
#if defined(I2C2)

/*! Macro to check I2C2 clock source */
#define IS_RCC_I2C2_CLK(source)                   \
  (((source) == HAL_RCC_I2C2_CLK_SRC_PCLK1)       \
   || ((source) == HAL_RCC_I2C2_CLK_SRC_PSIK)     \
   || ((source) == HAL_RCC_I2C2_CLK_SRC_HSIK))
#endif /* I2C2 */

/*! Macro to check I3C1 clock source */
#define IS_RCC_I3C1_CLK(source)                   \
  (((source) == HAL_RCC_I3C1_CLK_SRC_PCLK1)       \
   || ((source) == HAL_RCC_I3C1_CLK_SRC_PSIK)      \
   || ((source) == HAL_RCC_I3C1_CLK_SRC_HSIK))

/*! Macro to check ADCDAC clock source */
#define IS_RCC_ADCDAC_CLK(source)                 \
  (((source) == HAL_RCC_ADCDAC_CLK_SRC_HCLK)      \
   || ((source) == HAL_RCC_ADCDAC_CLK_SRC_PSIS)   \
   || ((source) == HAL_RCC_ADCDAC_CLK_SRC_PSIK)   \
   || ((source) == HAL_RCC_ADCDAC_CLK_SRC_HSIK))

/*! Macro to check DAC1SH clock source */
#define IS_RCC_DAC1_SH_CLK(source) \
  (((source) == HAL_RCC_DAC1_SH_CLK_SRC_LSE)         \
   || ((source) == HAL_RCC_DAC1_SH_CLK_SRC_LSI))

/*! Macro to check ADCDAC prescaler */
#define IS_RCC_ADCDAC_PRESCALER(prescaler)          \
  (((prescaler) == HAL_RCC_ADCDAC_PRESCALER1)       \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER2)    \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER4)    \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER8)    \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER16)   \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER32)   \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER64)   \
   || ((prescaler) == HAL_RCC_ADCDAC_PRESCALER128))

#if defined(LPTIM1)
/*! Macro to check LPTIM1 clock source */
#define IS_RCC_LPTIM1_CLK(source)                 \
  (((source) == HAL_RCC_LPTIM1_CLK_SRC_PCLK3)     \
   || ((source) == HAL_RCC_LPTIM1_CLK_SRC_HSIK)   \
   || ((source) == HAL_RCC_LPTIM1_CLK_SRC_LSE)    \
   || ((source) == HAL_RCC_LPTIM1_CLK_SRC_LSI))

#endif /* LPTIM1 */
/*! Macro to check RTC clock source */
#define IS_RCC_RTC_CLK(source)                    \
  (((source) == HAL_RCC_RTC_CLK_SRC_NONE)         \
   || ((source) == HAL_RCC_RTC_CLK_SRC_LSE)       \
   || ((source) == HAL_RCC_RTC_CLK_SRC_LSI)       \
   || ((source) == HAL_RCC_RTC_CLK_SRC_HSE_DIV))

/*! Macro to check the HSE division value */
#define IS_RCC_RTC_HSEDIV(div)      ((div) <= 511U)

/*! Macro to check CK48 clock source */
#define IS_RCC_CK48_CLK(source)                   \
  (((source) == HAL_RCC_CK48_CLK_SRC_PSIDIV3)     \
   || ((source) == HAL_RCC_CK48_CLK_SRC_HSIDIV3)  \
   || ((source) == HAL_RCC_CK48_CLK_SRC_HSE))
#if defined(XSPI1)

/*! Macro to check XSPI1 clock source */
#define IS_RCC_XSPI1_CLK(source)                  \
  (((source) == HAL_RCC_XSPI1_CLK_SRC_HCLK)       \
   || ((source) == HAL_RCC_XSPI1_CLK_SRC_PSIK)    \
   || ((source) == HAL_RCC_XSPI1_CLK_SRC_HSIK))
#endif /* XSPI1 */
#if defined(ETH1)

/*! Macro to check ETH1REF clock source */
#define IS_RCC_ETH1REF_CLK(source)                 \
  (((source) == HAL_RCC_ETH1REF_CLK_SRC_RMII)      \
   || ((source) == HAL_RCC_ETH1REF_CLK_SRC_FB))

/*! Macro to check ETH1PTP clock source */
#define IS_RCC_ETH1PTP_CLK(source)                 \
  (((source) == HAL_RCC_ETH1PTP_CLK_SRC_NONE)      \
   || ((source) == HAL_RCC_ETH1PTP_CLK_SRC_HCLK)   \
   || ((source) == HAL_RCC_ETH1PTP_CLK_SRC_PSIS)   \
   || ((source) == HAL_RCC_ETH1PTP_CLK_SRC_PSIK))

/*! Macro to check ETH1 clock source */
#define IS_RCC_ETH1_CLK(source)                    \
  (((source) == HAL_RCC_ETH1_CLK_SRC_NONE)         \
   || ((source) == HAL_RCC_ETH1_CLK_SRC_PSIS)      \
   || ((source) == HAL_RCC_ETH1_CLK_SRC_PSIK)      \
   || ((source) == HAL_RCC_ETH1_CLK_SRC_HSE))

/*! Macro to check ETH1 prescaler */
#define IS_RCC_ETH1_PRESCALER(prescaler)           \
  (((prescaler) == HAL_RCC_ETH1_PRESCALER1)        \
   || ((prescaler) == HAL_RCC_ETH1_PRESCALER2)     \
   || ((prescaler) == HAL_RCC_ETH1_PRESCALER4))

/*! Macro to check ETH1PTP prescaler */
#define IS_RCC_ETH1PTP_PRESCALER(prescaler)      ((0U < (prescaler)) && ((prescaler) <= 16U))

#endif /* ETH1 */

/*! Macro to check SysTick clock source */
#define IS_RCC_SYSTICK_CLK(source) (((source) == HAL_RCC_SYSTICK_CLK_SRC_HCLKDIV8)       \
                                    || ((source) == HAL_RCC_SYSTICK_CLK_SRC_LSE)         \
                                    || ((source) == HAL_RCC_SYSTICK_CLK_SRC_LSI))

/**
  * @brief Get the ADC kernel clock prescaler.
  */
#define RCC_ADCPRESC_BIT_VALUE  ((LL_RCC_GetADCDACPrescaler(ADC1_BASE) >> RCC_CCIPR2_ADCDACPRE_Pos))
/*! Macro to get the ADC prescaler */
#define RCC_GET_ADC_PRESCALER() (((RCC_ADCPRESC_BIT_VALUE) == 0x0U) ? 1U :   \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x1U) ? 2U :   \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x2U) ? 4U :   \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x3U) ? 8U :   \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x4U) ? 16U :  \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x5U) ? 32U :  \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x6U) ? 64U :  \
                                 ((RCC_ADCPRESC_BIT_VALUE) == 0x7U) ? 128U : 1U)
#if defined(ETH1)
/**
  * @brief Get the ETH1 kernel clock prescaler.
  */
#define RCC_ETH1PRESC_BIT_VALUE  ((LL_RCC_GetETH1Prescaler() >> RCC_CCIPR3_ETH1CLKDIV_Pos))
/*! Macro to get the ETH1 prescaler */
#define RCC_GET_ETH1_PRESCALER() (((RCC_ETH1PRESC_BIT_VALUE) == 0x0U) ? 1U :   \
                                  ((RCC_ETH1PRESC_BIT_VALUE) == 0x1U) ? 2U :   \
                                  ((RCC_ETH1PRESC_BIT_VALUE) == 0x2U) ? 4U : 1U)

/**
  * @brief Get the ETH1PTP kernel clock prescaler.
  */
#define RCC_ETH1PTPPRESC_BIT_VALUE  (LL_RCC_GetETH1PTPPrescaler())
/*! Macro to get the ETH1PTP prescaler */
#define RCC_GET_ETH1PTP_PRESCALER() (((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x1U) ? 1U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x2U) ? 2U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x3U) ? 3U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x4U) ? 4U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x5U) ? 5U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x6U) ? 6U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x7U) ? 7U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x8U) ? 8U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x9U) ? 9U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xAU) ? 10U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xBU) ? 11U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xCU) ? 12U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xDU) ? 13U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xEU) ? 14U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0xFU) ? 15U :   \
                                     ((RCC_ETH1PTPPRESC_BIT_VALUE) == 0x10U) ? 16U : 1U)
#endif /* ETH1 */

/**
  * @}
  */
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCC_Private_Functions RCC Private Functions
  * @{
  */
static hal_status_t RCC_WaitForTimeout(const rcc_cb_timeout_t p_timeout_cb, uint32_t timeout, uint32_t status);
static uint32_t RCC_GetDividerValue(uint32_t divider);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup RCC_Exported_Functions
  * @{
  */

/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/** @addtogroup RCC_Exported_Functions_Group1_0
  * @{
  */

/**
  * @brief   Reset the RCC clock configuration to the default reset state.
  * @note    SystemCoreClock and HAL timebase are updated in this function.
  * @note    Resources under backup domain reset if USE_HAL_RCC_RESET_RTC_DOMAIN set to 1U
  * @note    Peripherals clock enable and source selection reset if USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT set to 1U
  * @warning Access to RTC domain must be enabled to disable RTC domain source clock.
  */
void HAL_RCC_Reset(void)
{
  uint32_t tickstart;
  uint32_t read_value;

