MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  /* Disable RCC interrupts */
  LL_RCC_DisableIT(LL_RCC_IT_LSIRDY | LL_RCC_IT_LSERDY | LL_RCC_IT_HSIRDY | LL_RCC_IT_HSIDIV3RDY | \
                   LL_RCC_IT_HSIKRDY | LL_RCC_IT_PSIRDY | LL_RCC_IT_PSIDIV3RDY | LL_RCC_IT_PSIKRDY | LL_RCC_IT_HSERDY);

#if defined(USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT) && (USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT == 1U)
  /* Reset peripheral clock enable */
  LL_RCC_WRITE_REG(CFGR2, RCC_CFGR2_Rst);

  LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_ALL & (~(RCC_AHB1ENR_FLASHEN | RCC_AHB1ENR_SRAM2EN |
                                                         RCC_AHB1ENR_SRAM1EN)));
  LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_ALL);
#if defined(AHB4PERIPH_BASE)
  LL_AHB4_GRP1_DisableClock(LL_AHB4_GRP1_PERIPH_ALL);
#endif /* AHB4PERIPH_BASE */
  LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_ALL);
  LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_ALL);
  LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_ALL);
  LL_APB3_GRP1_DisableClock(LL_APB3_GRP1_PERIPH_ALL);

  LL_AHB1_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_ALL);
  LL_AHB2_GRP1_EnableClockLowPower(LL_AHB2_GRP1_PERIPH_ALL);
#if defined(AHB4PERIPH_BASE)
  LL_AHB4_GRP1_EnableClockLowPower(LL_AHB4_GRP1_PERIPH_ALL);
#endif /* AHB4PERIPH_BASE */
  LL_APB1_GRP1_EnableClockLowPower(LL_APB1_GRP1_PERIPH_ALL);
  LL_APB1_GRP2_EnableClockLowPower(LL_APB1_GRP2_PERIPH_ALL);
  LL_APB2_GRP1_EnableClockLowPower(LL_APB2_GRP1_PERIPH_ALL);
  LL_APB3_GRP1_EnableClockLowPower(LL_APB3_GRP1_PERIPH_ALL);

  /* Reset peripheral clock source selection */
  LL_RCC_WRITE_REG(CCIPR1, RCC_CCIPR1_Rst);
  LL_RCC_WRITE_REG(CCIPR2, RCC_CCIPR2_Rst);
#if defined(RCC_CCIPR3_Rst)
  LL_RCC_WRITE_REG(CCIPR3, RCC_CCIPR3_Rst);
#endif /* RCC_CCIPR3_Rst */

#endif /* USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT */

  /* Reset System clock */
  LL_RCC_HSIDIV3_Enable();
  (void)RCC_WaitForTimeout(LL_RCC_HSIDIV3_IsReady, RCC_HSI_TIMEOUT_VALUE, 1U);

  tickstart = HAL_GetTick();

  /* HSIDIV3 is selected as system clock source */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSIDIV3);

  /* Wait till clock switch is ready */
  while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3)
  {
    if ((HAL_GetTick() - tickstart) > RCC_CLOCKSWITCH_TIMEOUT_VALUE)
    {
      break;
    }
  }


  /* Reset all bus dividers */
  LL_RCC_ConfigBusClock((uint32_t)LL_RCC_HCLK_PRESCALER_1 | (uint32_t)LL_RCC_APB1_PRESCALER_1 |
                        (uint32_t)LL_RCC_APB2_PRESCALER_1 |
                        (uint32_t)LL_RCC_APB3_PRESCALER_1);

  SystemCoreClock = HSI_RESET_VALUE;

  LL_RCC_SetSystickClockSource(LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8);

  /* Adapt Systick interrupt period */
  (void)HAL_InitTick(HAL_TICK_FREQ_DEFAULT, uwTickPrio);

#if defined(USE_HAL_RCC_RESET_RTC_DOMAIN) && (USE_HAL_RCC_RESET_RTC_DOMAIN == 1U)
  /* Reset backup domain */
  LL_RCC_ForceRTCDomainReset();
  LL_RCC_ReleaseRTCDomainReset();
#endif /* USE_HAL_RCC_RESET_RTC_DOMAIN */

  /* Reset all remaining oscillators not in backup domain (excepted the one used for System clock) */
  read_value = LL_RCC_READ_REG(CR1);
  LL_RCC_WRITE_REG(CR1, (RCC_CR1_Rst | (read_value & (RCC_CR1_HSEBYP | RCC_CR1_HSEEXT))));
  LL_RCC_WRITE_REG(CR1, RCC_CR1_Rst); /* HSE EXT and BYP disabled only when HSE has been disabled */
  LL_RCC_WRITE_REG(CR2, RCC_CR2_Rst);
  LL_RCC_LSI_Disable();

  /* Reset MCO, RTC prescaler and wake up system clock */
#if defined(USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT) && (USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT == 1U)
  /* Reset MCOx and RTC prescaler */
  LL_RCC_WRITE_REG(CFGR1, RCC_CFGR1_Rst);
#else
  /* Reset MCOx prescaler */
  read_value = LL_RCC_READ_REG(CFGR1);

  LL_RCC_WRITE_REG(CFGR1, (RCC_CFGR1_Rst | (read_value & RCC_CFGR1_RTCPRE)));
#endif /* USE_HAL_RCC_RESET_PERIPH_CLOCK_MANAGEMENT */

  /* Clear RCC flags */
  LL_RCC_ClearFlag(LL_RCC_IT_LSIRDY | LL_RCC_IT_LSERDY | LL_RCC_IT_HSIRDY | LL_RCC_IT_HSIDIV3RDY | \
                   LL_RCC_IT_HSIKRDY | LL_RCC_IT_PSIRDY | LL_RCC_IT_PSIDIV3RDY | LL_RCC_IT_PSIKRDY | \
                   LL_RCC_IT_HSERDY | LL_RCC_IT_HSECSS | LL_RCC_IT_LSECSS);

  LL_RCC_ForceClearResetFlags();
  LL_RCC_ReleaseClearResetFlags();
}

/**
  * @brief  Reset the RCC clock configuration to the default system clock (HSIDIV3 at 48 MHz).
  * @note   SystemCoreClock and Systick are updated in this function.
  * @retval HAL_OK    System clock switched to HSIDIV3 (48MHz)
  * @retval HAL_ERROR Timeout issue to enable the HSIDIV3 clock\n
  *                   Switch to HSIDIV3 as source clock failed\n
  *                   Issue to reconfigure the System tick
  */
hal_status_t HAL_RCC_ResetSystemClock(void)
{
  uint32_t tickstart;

  LL_RCC_HSIDIV3_Enable();

  if (RCC_WaitForTimeout(LL_RCC_HSIDIV3_IsReady, RCC_HSI_TIMEOUT_VALUE, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  /* HSIDIV3 is selected as system clock source */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSIDIV3);

  /* Wait till clock switch is ready */
  while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3)
  {
    if ((HAL_GetTick() - tickstart) > RCC_CLOCKSWITCH_TIMEOUT_VALUE)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3)
      {
        return HAL_ERROR;
      }
    }
  }

  SystemCoreClock = HSI_RESET_VALUE;

  /* Adapt Systick interrupt period */
  return (HAL_InitTick(HAL_TICK_FREQ_DEFAULT, uwTickPrio));
}
/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group1_1
  * @{
  */
/**
  * @brief  Enable the HSI oscillator in Stop mode.
  * @retval HAL_OK      HSI oscillator is forced ON even in Stop mode.
  */
hal_status_t HAL_RCC_HSI_EnableInStopMode(void)
{
  LL_RCC_HSI_EnableInStopMode();
  return HAL_OK;
}

/**
  * @brief  Disable the HSI oscillator in Stop mode.
  * @retval HAL_OK      HSI oscillator is disabled in Stop mode.
  */
hal_status_t HAL_RCC_HSI_DisableInStopMode(void)
{
  LL_RCC_HSI_DisableInStopMode();
  return HAL_OK;
}

/**
  * @brief  Check if HSI in stop mode is enabled.
  * @retval status based on @ref hal_rcc_osc_stop_mode_status_t
  * @retval HAL_RCC_OSC_DISABLED_IN_STOP_MODE   HSI is disabled in stop mode
  * @retval HAL_RCC_OSC_ENABLED_IN_STOP_MODE    HSI is enabled in stop mode
  */
hal_rcc_osc_stop_mode_status_t HAL_RCC_HSI_IsEnabledInStopMode(void)
{
  return (hal_rcc_osc_stop_mode_status_t)LL_RCC_HSI_IsEnabledInStopMode();
}

/**
  * @brief  Enable the HSIS clock for system.
  * @retval HAL_OK      HSIS clock has been successfully activated
  * @retval HAL_ERROR   Timeout linked to HSIS ready flag not set
  * @note               If HSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_HSIS_Enable(void)
{
  LL_RCC_HSIS_Enable();

  return RCC_WaitForTimeout(LL_RCC_HSIS_IsReady, RCC_HSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the HSIS clock for system.
  * @retval HAL_OK      HSIS clock has been successfully deactivated
  * @retval HAL_ERROR   HSIS clock is used as system clock\n
  *                     HSIDIV18 clock is used as source clock of the PSI oscillator and PSI is used as system clock\n
  *                     Timeout linked to HSIS ready flag not reset
  * @note If all other clocks of the HSI oscillator are disabled (HSIDIV3 and HSIK), disable the HSI oscillator.
  */
hal_status_t HAL_RCC_HSIS_Disable(void)
{
  uint32_t psiclk_source;
  uint32_t sysclk_source;
  hal_status_t status;

  sysclk_source = LL_RCC_GetSysClkSource();
  psiclk_source = LL_RCC_GetPSIClkSource();

