MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  /* Check that HSIS is not used as system clock */
  if ((sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSIS)
      || ((sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_PSIS) && (psiclk_source == LL_RCC_PSISOURCE_HSIDIV18)))
  {
    status = HAL_ERROR;
  }
  else
  {
    LL_RCC_HSIS_Disable();
    status = RCC_WaitForTimeout(LL_RCC_HSIS_IsReady, RCC_HSI_TIMEOUT_VALUE, 0U);
  }

  return status;
}

/**
  * @brief  Check if HSIS is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  HSIS clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   HSIS clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_HSIS_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_HSIS_IsEnabled();
}

/**
  * @brief  Check if HSIS is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       HSIS is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   HSIS can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_HSIS_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_HSIS_IsReady();
}

/**
  * @brief  Enable the HSIDIV3 clock for system or for peripheral clock source.
  * @retval HAL_OK      HSIDIV3 clock has been successfully activated
  * @retval HAL_ERROR   Timeout linked to HSIDIV3 ready flag not set
  * @note               If HSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_HSIDIV3_Enable(void)
{
  LL_RCC_HSIDIV3_Enable();

  return RCC_WaitForTimeout(LL_RCC_HSIDIV3_IsReady, RCC_HSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the HSIDIV3 clock.
  * @warning This HSIDIV3 clock might be used as peripheral clock source
  *         and this function will stop any peripherals using it.
  * @retval HAL_OK      HSIDIV3 clock has been successfully deactivated
  * @retval HAL_ERROR   HSIDIV3 clock is used as system clock\n
  *                     Timeout linked to HSIDIV3 ready flag not reset
  * @note If all other clocks of the HSI oscillator are disabled (HSIS and HSIK), disable the HSI oscillator.
  */
hal_status_t HAL_RCC_HSIDIV3_Disable(void)
{
  uint32_t sysclk_source;
  hal_status_t status;

  sysclk_source = LL_RCC_GetSysClkSource();

  /* Check that HSIDIV3 is not used as system clock */
  if (sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3)
  {
    status = HAL_ERROR;
  }
  else
  {
    LL_RCC_HSIDIV3_Disable();
    status = RCC_WaitForTimeout(LL_RCC_HSIDIV3_IsReady, RCC_HSI_TIMEOUT_VALUE, 0U);
  }

  return status;
}

/**
  * @brief  Check if HSIDIV3 is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  HSIDIV3 clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   HSIDIV3 clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_HSIDIV3_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_HSIDIV3_IsEnabled();
}

/**
  * @brief  Check if HSIDIV3 is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       HSIDIV3 is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   HSIDIV3 can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_HSIDIV3_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_HSIDIV3_IsReady();
}

/**
  * @brief  Enable the HSIK clock.
  * @param  divider     Prescaler value
  * @retval HAL_OK      HSIK clock has been activated successfully
  * @retval HAL_ERROR   Timeout linked to HSIK ready flag not set\n
  * @note               If HSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_HSIK_Enable(hal_rcc_hsik_div_t divider)
{
  ASSERT_DBG_PARAM(IS_RCC_HSIKDIV(divider));

  LL_RCC_HSIK_SetDivider((uint32_t)divider);

  LL_RCC_HSIK_Enable();

  return RCC_WaitForTimeout(LL_RCC_HSIK_IsReady, RCC_HSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the HSIK clock.
  * @warning This HSIK clock might be used as peripheral clock source
  *         and this function will stop any peripherals using it.
  * @retval HAL_OK      HSIK clock has been successfully deactivated
  *         HAL_ERROR   Timeout linked to HSIK ready flag not reset
  * @note If all other clocks of the HSI oscillator are disabled (HSIS and HSIDIV3), disable the HSI oscillator.
  */
hal_status_t HAL_RCC_HSIK_Disable(void)
{
  hal_status_t status;

  LL_RCC_HSIK_Disable();
  status = RCC_WaitForTimeout(LL_RCC_HSIK_IsReady, RCC_HSI_TIMEOUT_VALUE, 0U);

  return status;
}

/**
  * @brief  Check if HSIK is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  HSIK clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   HSIK clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_HSIK_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_HSIK_IsEnabled();
}

/**
  * @brief  Check if HSIK is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       HSIK is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   HSIK can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_HSIK_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_HSIK_IsReady();
}

/**
  * @brief  Get HSIK prescaler value.
  * @retval value based on @ref hal_rcc_hsik_div_t
  */
hal_rcc_hsik_div_t HAL_RCC_HSIK_GetDivider(void)
{
  return (hal_rcc_hsik_div_t)LL_RCC_HSIK_GetDivider();
}

/**
  * @brief  Enable the Internal Low Speed oscillator (LSI).
  * @retval HAL_OK      LSI oscillator has been configured successfully
  * @retval HAL_ERROR   Timeout linked to LSI ready flag not set\n
  */
hal_status_t HAL_RCC_LSI_Enable(void)
{
  LL_RCC_LSI_Enable();

  return RCC_WaitForTimeout(LL_RCC_LSI_IsReady, RCC_LSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the LSI oscillator.
  * @warning This oscillator might be used as peripheral clock source
  *         and this function will stop any peripherals using it.
  * @retval HAL_OK      LSI oscillator has been deactivated successfully
  * @retval HAL_ERROR   Timeout linked to LSI ready flag not reset\n
  */
hal_status_t HAL_RCC_LSI_Disable(void)
{
  LL_RCC_LSI_Disable();

  return RCC_WaitForTimeout(LL_RCC_LSI_IsReady, RCC_LSI_TIMEOUT_VALUE, 0U);
}

/**
  * @brief  Check if LSI is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  LSI clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   LSI clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_LSI_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_LSI_IsEnabled();
}

/**
  * @brief  Check if LSI is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       LSI is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   LSI can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_LSI_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_LSI_IsReady();
}

#if defined(HSE_VALUE)
/**
  * @brief  Enable the HSE oscillator in the selected mode.
  * @param  mode        HSE mode.\n This parameter can be one of the following values:
  *         @arg @ref HAL_RCC_HSE_ON
  *         @arg @ref HAL_RCC_HSE_BYPASS
  *         @arg @ref HAL_RCC_HSE_BYPASS_DIGITAL
  * @note   Transitions HSE Bypass to HSE On and HSE On to HSE Bypass are not
  *         supported by this function.
  * @retval HAL_OK      HSE oscillator has been activated and configured
  * @retval HAL_ERROR   Timeout linked to HSE ready flag not set
  */
hal_status_t HAL_RCC_HSE_Enable(hal_rcc_hse_t mode)
{
  ASSERT_DBG_PARAM(IS_RCC_HSE_MODE_ENABLE(mode));

