MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  /* Set the new HSE configuration */
  if (((uint32_t)mode & RCC_CR1_HSEBYP) == RCC_CR1_HSEBYP)
  {
    LL_RCC_HSE_ConfigBypass((uint32_t)mode & RCC_CR1_HSEEXT);
  }

  LL_RCC_HSE_Enable();

  return RCC_WaitForTimeout(LL_RCC_HSE_IsReady, RCC_HSE_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the HSE oscillator.
  * @warning This oscillator might be used as peripheral clock source
  *         and this function will stop any peripherals using it.
  * @retval HAL_OK      HSE oscillator has been deactivated successfully
  * @retval HAL_ERROR   HSE is used as source clock of the PSI oscillator and PSI is used as system clock\n
  * @retval             HSE clock is used as system clock\n
  * @retval             Timeout linked to HSE ready flag not reset
  */
hal_status_t HAL_RCC_HSE_Disable(void)
{
  uint32_t sysclk_source;
  uint32_t psiclk_source;
  hal_status_t status;

  sysclk_source = LL_RCC_GetSysClkSource();
  psiclk_source = LL_RCC_GetPSIClkSource();

  /* Check that HSE is not used as system clock */
  if ((sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSE)
      || ((sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_PSIS) && (psiclk_source == LL_RCC_PSISOURCE_HSE)))
  {
    status = HAL_ERROR;
  }
  else
  {
    LL_RCC_HSE_Disable();
    LL_RCC_HSE_DisableBypass();
    LL_RCC_HSE_SetClockMode(LL_RCC_HSE_ANALOG_MODE);
    status = RCC_WaitForTimeout(LL_RCC_HSE_IsReady, RCC_HSE_TIMEOUT_VALUE, 0U);

  }

  return status;
}

/**
  * @brief  Check if HSE is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  HSE clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   HSE clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_HSE_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_HSE_IsEnabled();
}

/**
  * @brief  Check if HSE is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       HSE is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   HSE can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_HSE_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_HSE_IsReady();
}

#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
/**
  * @brief  Enable the LSE oscillator in the selected mode with an oscillator drive capability.
  * @param  mode        LSE mode.\n This parameter can be one of the following values:
  *         @arg @ref HAL_RCC_LSE_ON
  *         @arg @ref HAL_RCC_LSE_BYPASS
  *         @arg @ref HAL_RCC_LSE_BYPASS_DIGITAL
  * @param  drive         LSE drive capability
  * @warning Access to backup domain must be enabled.
  * @note   Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not
  *         supported by this function. Transitions between drive capability not supported.
  * @note   Drive capability is relevant only in Xtal mode (means not in bypass mode)
  * @retval HAL_OK      LSE oscillator has been configured successfully
  * @retval HAL_ERROR   Backup domain is not enabled\n
  *                     Timeout linked to LSE ready flag not set\n
  */
hal_status_t HAL_RCC_LSE_Enable(hal_rcc_lse_t mode, hal_rcc_lse_drive_t drive)
{

  ASSERT_DBG_PARAM(IS_RCC_LSE_MODE_ENABLE(mode));
  ASSERT_DBG_PARAM(IS_RCC_LSE_DRIVE(drive));

  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

  /* Set the new LSE configuration ---------------------------------------*/
  if (((uint32_t)mode & RCC_RTCCR_LSEBYP) == RCC_RTCCR_LSEBYP)
  {
    LL_RCC_LSE_ConfigBypass((uint32_t)mode & RCC_RTCCR_LSEEXT);
  }
  else
  {
    LL_RCC_LSE_SetDriveCapability((uint32_t)drive);
  }
  /* Enable LSE and wait for activation */
  LL_RCC_LSE_Enable();
  if (RCC_WaitForTimeout(LL_RCC_LSE_IsReady, RCC_LSE_TIMEOUT_VALUE, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Disable the LSE oscillator.
  * @warning This oscillator might be used as peripheral clock source
  *         and this function will stop any peripherals using it.
  * @warning Access to backup domain must be enabled.
  * @retval HAL_OK      LSE oscillator has been configured successfully
  * @retval HAL_ERROR   Backup domain is not enabled\n
  *                     Timeout linked to LSE ready flag not reset\n
  */
hal_status_t HAL_RCC_LSE_Disable(void)
{
  uint32_t sysclk_source;
  uint32_t psiclk_source;

  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

  sysclk_source = LL_RCC_GetSysClkSource();
  psiclk_source = LL_RCC_GetPSIClkSource();
  /* Check that LSE is not used as system clock */
  if ((sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_PSIS) && (psiclk_source == LL_RCC_PSISOURCE_LSE))
  {
    return HAL_ERROR;
  }

  LL_RCC_LSE_Disable();
  LL_RCC_LSE_DisableBypass();
  LL_RCC_LSE_SetClockMode(LL_RCC_LSE_ANALOG_MODE);
  if (RCC_WaitForTimeout(LL_RCC_LSE_IsReady, RCC_LSE_TIMEOUT_VALUE, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset LSE drive to low value (default) */
  LL_RCC_LSE_SetDriveCapability(LL_RCC_LSEDRIVE_LOW);

  return HAL_OK;
}

/**
  * @brief  Check if LSE is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  LSE clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   LSE clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_LSE_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_LSE_IsEnabled();
}

/**
  * @brief  Check if LSE is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       LSE is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   LSE can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_LSE_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_LSE_IsReady();
}

#endif /* LSE_VALUE */
/**
  * @brief  Enable the PSI oscillator in Stop mode.
  * @retval HAL_OK      PSI oscillator is forced ON even in Stop mode.
  */
hal_status_t HAL_RCC_PSI_EnableInStopMode(void)
{
  LL_RCC_PSI_EnableInStopMode();
  return HAL_OK;
}

/**
  * @brief  Disable the PSI oscillator in Stop mode.
  * @retval HAL_OK      PSI oscillator is disabled in Stop mode.
  */
hal_status_t HAL_RCC_PSI_DisableInStopMode(void)
{
  LL_RCC_PSI_DisableInStopMode();
  return HAL_OK;
}

/**
  * @brief  Check if PSI in stop mode is enabled.
  * @retval status based on @ref hal_rcc_osc_stop_mode_status_t
  * @retval HAL_RCC_OSC_DISABLED_IN_STOP_MODE   PSI is disabled in stop mode
  * @retval HAL_RCC_OSC_ENABLED_IN_STOP_MODE    PSI is enabled in stop mode
  */
hal_rcc_osc_stop_mode_status_t HAL_RCC_PSI_IsEnabledInStopMode(void)
{
  return (hal_rcc_osc_stop_mode_status_t)LL_RCC_PSI_IsEnabledInStopMode();
}

/**
  * @brief  Enable the PSIS clock for system.
  * @retval HAL_OK      PSIS clock has been activated successfully
  * @retval HAL_ERROR   Timeout linked to PSIS ready flag not set
  * @note               If PSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_PSIS_Enable(void)
{
  LL_RCC_PSIS_Enable();

  return RCC_WaitForTimeout(LL_RCC_PSIS_IsReady, RCC_PSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the PSIS clock for system.
  * @retval HAL_OK      PSIS clock has been deactivated successfully
  * @retval HAL_ERROR   PSIS clock is used as system clock\n
  *                     Timeout linked to PSIS ready flag not reset
  * @note If all other clocks of the PSI oscillator are disabled (PSIK and PSIDIV3), disable the PSI oscillator.
  */

hal_status_t HAL_RCC_PSIS_Disable(void)
{
  uint32_t sysclk_source;
  hal_status_t status;

  sysclk_source = LL_RCC_GetSysClkSource();

  /* Check that PSIS is not used as system clock */
  if (sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_PSIS)
  {
    status = HAL_ERROR;
  }
  else
  {
    LL_RCC_PSIS_Disable();
    status = RCC_WaitForTimeout(LL_RCC_PSIS_IsReady, RCC_PSI_TIMEOUT_VALUE, 0U);
  }

