MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  return status;
}

/**
  * @brief  Check if PSIS is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  PSIS clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   PSIS clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_PSIS_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_PSIS_IsEnabled();
}

/**
  * @brief  Check if PSIS is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       PSIS is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   PSIS can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_PSIS_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_PSIS_IsReady();
}

/**
  * @brief  Enable the PSIDIV3 clock for system or for peripheral clock source.
  * @retval HAL_OK      PSIDIV3 clock has been activated successfully
  * @retval HAL_ERROR   Timeout linked to PSIDIV3 ready flag not set
  * @note               If PSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_PSIDIV3_Enable(void)
{
  LL_RCC_PSIDIV3_Enable();

  return RCC_WaitForTimeout(LL_RCC_PSIDIV3_IsReady, RCC_PSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the PSIDIV3 clock for system or for peripheral clock source.
  * @warning This PSIDIV3 clock might be used as peripheral clock source
  *         and this function will stop any peripheral functions.
  * @retval HAL_OK      PSIDIV3 clock has been deactivated successfully
  *         HAL_ERROR   Timeout linked to PSIDIV3 ready flag not reset
  * @note If all other clocks of the PSI oscillator are disabled (PSIK and PSIS), disable the PSI oscillator.
  */
hal_status_t HAL_RCC_PSIDIV3_Disable(void)
{
  hal_status_t status;


  LL_RCC_PSIDIV3_Disable();
  status = RCC_WaitForTimeout(LL_RCC_PSIDIV3_IsReady, RCC_PSI_TIMEOUT_VALUE, 0U);

  return status;
}

/**
  * @brief  Check if PSIDIV3 is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  PSIDIV3 clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   PSIDIV3 clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_PSIDIV3_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_PSIDIV3_IsEnabled();
}

/**
  * @brief  Check if PSIDIV3 is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       PSIDIV3 is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   PSIDIV3 can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_PSIDIV3_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_PSIDIV3_IsReady();
}

/**
  * @brief  Enable the PSIK clock for peripheral clock source.
  * @param  divider     Prescaler value
  * @retval HAL_OK      PSIK clock has been activated successfully
  * @retval HAL_ERROR   Timeout linked to PSIK ready flag not set\n
  * @note               If PSI oscillator is disabled, enable it.
  */
hal_status_t HAL_RCC_PSIK_Enable(hal_rcc_psik_div_t divider)
{
  ASSERT_DBG_PARAM(IS_RCC_PSIKDIV(divider));

  LL_RCC_PSIK_SetDivider((uint32_t)divider);

  LL_RCC_PSIK_Enable();

  return RCC_WaitForTimeout(LL_RCC_PSIK_IsReady, RCC_PSI_TIMEOUT_VALUE, 1U);
}

/**
  * @brief  Disable the PSIK clock for peripheral clock source.
  * @warning This PSIK clock might be used as peripheral clock source
  *         and this function will stop any peripheral functions.
  * @retval HAL_OK      PSIK clock has been deactivated successfully
  *         HAL_ERROR   Timeout linked to PSIK ready flag not reset
  * @note If all other clocks of the PSI oscillator are disabled (PSIS and PSIDIV3), disable the PSI oscillator.
  */
hal_status_t HAL_RCC_PSIK_Disable(void)
{
  hal_status_t status;

  LL_RCC_PSIK_Disable();
  status = RCC_WaitForTimeout(LL_RCC_PSIK_IsReady, RCC_PSI_TIMEOUT_VALUE, 0U);

  return status;
}

/**
  * @brief  Check if PSIK is enabled.
  * @retval status based on @ref hal_rcc_osc_enable_status_t
  * @retval HAL_RCC_OSC_DISABLED  PSIK clock is disabled
  * @retval HAL_RCC_OSC_ENABLED   PSIK clock is enabled
  */
hal_rcc_osc_enable_status_t HAL_RCC_PSIK_IsEnabled(void)
{
  return (hal_rcc_osc_enable_status_t)LL_RCC_PSIK_IsEnabled();
}

/**
  * @brief  Check if PSIK is ready.
  * @retval status based on @ref hal_rcc_osc_ready_status_t
  * @retval HAL_RCC_OSC_READY       PSIK is enabled and ready
  * @retval HAL_RCC_OSC_NOT_READY   PSIK can be enabled but not ready
  */
hal_rcc_osc_ready_status_t HAL_RCC_PSIK_IsReady(void)
{
  return (hal_rcc_osc_ready_status_t)LL_RCC_PSIK_IsReady();
}

/**
  * @brief  Get PSIK prescaler value.
  * @retval value based on @ref hal_rcc_psik_div_t
  */
hal_rcc_psik_div_t HAL_RCC_PSIK_GetDivider(void)
{
  return (hal_rcc_psik_div_t)LL_RCC_PSIK_GetDivider();
}

/**
  * @brief Configure PSI oscillator without enabling outputs clock.
  * @details The config function will perform the following actions:
  *           - Check in PSI is well deactivated (if enabled exit from this function)
  *           - Configure the PSI with full list of parameters
  * @param p_config pointer to a @ref hal_rcc_psi_config_t structure that
  *          contains the configuration information for the PSI
  * @retval HAL_OK            PSI has been correctly configured
  * @retval HAL_INVALID_PARAM Input parameter not valid (USE_HAL_CHECK_PARAM enabled)
  * @retval HAL_ERROR         PSI is already enabled and cannot be modified.
  * @note Ensure a valid configuration. See PSI section on RCC chapter of the RM.
  */
hal_status_t HAL_RCC_PSI_SetConfig(const hal_rcc_psi_config_t *p_config)
{
  uint32_t is_psis_ready;
  uint32_t is_psidiv3_ready;
  uint32_t is_psik_ready;

  ASSERT_DBG_PARAM(p_config != (void *)NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_RCC_PSISOURCE(p_config->psi_source));
  ASSERT_DBG_PARAM(IS_RCC_PSIREF(p_config->psi_ref));
  ASSERT_DBG_PARAM(IS_RCC_PSIOUT(p_config->psi_out));

  is_psis_ready = LL_RCC_PSIS_IsReady();
  is_psidiv3_ready = LL_RCC_PSIDIV3_IsReady();
  is_psik_ready = LL_RCC_PSIK_IsReady();

  /* Check if PSI is disabled */
  if ((is_psis_ready == 0U) && (is_psidiv3_ready == 0U) && (is_psik_ready == 0U))
  {
    LL_RCC_ConfigPSI((uint32_t)(p_config->psi_out), (uint32_t)(p_config->psi_ref), (uint32_t)(p_config->psi_source));
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief Return the configuration of PSI.
  * @param p_config  pointer to a @ref hal_rcc_psi_config_t structure that
  *          contains the configuration information for the PSI
  */
void HAL_RCC_PSI_GetConfig(hal_rcc_psi_config_t *p_config)
{
  uint32_t psi_source;
  uint32_t psi_ref;
  uint32_t psi_out;

  ASSERT_DBG_PARAM(p_config != (void *)NULL);

  /* Get PSI config */
  LL_RCC_GetConfigPSI(&psi_out, &psi_ref, &psi_source);

