MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  p_config->psi_source  = (hal_rcc_psi_src_t)psi_source;
  p_config->psi_ref  = (hal_rcc_psi_ref_t)psi_ref;
  p_config->psi_out  = (hal_rcc_psi_out_t)psi_out;
}
/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group1_2
  * @{
  */
/**
  * @brief  Set the CPU bus clock source (SYSCLK).
  * @param  source  System clock source based on @ref hal_rcc_sysclk_src_t
  * @note   Ensure that the clock source is ready.
  * @note   When running from Flash, ensure that the number of flash wait states is
  *         correct for the selected HCLK frequency.
  * @retval HAL_OK    Success\n
  * @retval HAL_ERROR System clock source has not been applied\n
  *                   HSIS not enabled to switch to HSIS as system clock\n
  *                   HSIDIV3 not enabled to switch to HSIDIV3 as system clock\n
  *                   HSE not enabled to switch to HSE as system clock\n
  *                   PSIS not enabled to switch to PSIS as system clock\n
  */
hal_status_t HAL_RCC_SetSYSCLKSource(hal_rcc_sysclk_src_t source)
{
  uint32_t tickstart;
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM(IS_RCC_SYSCLKSOURCE(source));

  LL_RCC_SetSysClkSource((uint32_t)source);

  tickstart = HAL_GetTick();

  while (HAL_RCC_GetSYSCLKSource() != source)
  {
    if ((HAL_GetTick() - tickstart) > RCC_CLOCKSWITCH_TIMEOUT_VALUE)
    {
      status = HAL_ERROR;
      break;
    }
  }

  return status;
}

/**
  * @brief   Get the system clock source (SYSCLK).
  * @retval  hal_rcc_sysclk_src_t System Clock source
  */
hal_rcc_sysclk_src_t HAL_RCC_GetSYSCLKSource(void)
{
  return (hal_rcc_sysclk_src_t)(uint32_t)((LL_RCC_GetSysClkSource() >> RCC_CFGR1_SWS_Pos) << RCC_CFGR1_SW_Pos);
}

/**
  * @brief  Set the Systick external clock source.
  * @param  clk_src Systick external clock source selection based on @ref hal_rcc_systick_clk_src_t
  */
void HAL_RCC_SetSysTickExternalClkSource(hal_rcc_systick_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_SYSTICK_CLK(clk_src));

  LL_RCC_SetSystickClockSource((uint32_t)clk_src);
}

/**
  * @brief  Get the Systick external clock source.
  * @retval Systick external clock source based on @ref hal_rcc_systick_clk_src_t
  */
hal_rcc_systick_clk_src_t HAL_RCC_GetSysTickExternalClkSource(void)
{
  return (hal_rcc_systick_clk_src_t)LL_RCC_GetSystickClockSource();
}

/**
  * @brief  Set the HCLK (AHB clock) prescaler.
  * @param  prescaler  Prescaler value
  */
void HAL_RCC_SetHCLKPrescaler(hal_rcc_hclk_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_HCLK(prescaler));

  LL_RCC_SetAHBPrescaler((uint32_t)prescaler);
}

/**
  * @brief  Set the PCLK1 (APB1 clock) prescaler.
  * @param prescaler  Prescaler value
  */
void HAL_RCC_SetPCLK1Prescaler(hal_rcc_pclk_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_PCLK(prescaler));

  LL_RCC_SetAPB1Prescaler((uint32_t)prescaler);
}

/**
  * @brief  Set the PCLK2 (APB2 clock) prescaler.
  * @param prescaler  Prescaler value
  */
void HAL_RCC_SetPCLK2Prescaler(hal_rcc_pclk_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_PCLK(prescaler));

  LL_RCC_SetAPB2Prescaler(((uint32_t)prescaler) << (RCC_CFGR2_PPRE2_Pos - RCC_CFGR2_PPRE1_Pos));
}

/**
  * @brief  Set the PCLK3 (APB3 clock) prescaler.
  * @param prescaler  Prescaler value
  */
void HAL_RCC_SetPCLK3Prescaler(hal_rcc_pclk_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_PCLK(prescaler));

  LL_RCC_SetAPB3Prescaler(((uint32_t)prescaler) << (RCC_CFGR2_PPRE3_Pos - RCC_CFGR2_PPRE1_Pos));
}

/**
  * @brief  Get the AHB bus clock prescaler (HCLK).
  * @retval hal_rcc_hclk_prescaler_t Prescaler value
  */
hal_rcc_hclk_prescaler_t HAL_RCC_GetHCLKPrescaler(void)
{
  return (hal_rcc_hclk_prescaler_t)LL_RCC_GetAHBPrescaler();
}

/**
  * @brief  Set the APB1 bus clock prescaler (PCLK1).
  * @retval hal_rcc_pclk_prescaler_t Prescaler value
  */
hal_rcc_pclk_prescaler_t HAL_RCC_GetPCLK1Prescaler(void)
{
  return (hal_rcc_pclk_prescaler_t)LL_RCC_GetAPB1Prescaler();
}

/**
  * @brief  Set the APB2 bus clock prescaler (PCLK2).
  * @retval hal_rcc_pclk_prescaler_t Prescaler value
  */
hal_rcc_pclk_prescaler_t HAL_RCC_GetPCLK2Prescaler(void)
{
  return (hal_rcc_pclk_prescaler_t)(uint32_t)(LL_RCC_GetAPB2Prescaler() >> (RCC_CFGR2_PPRE2_Pos - RCC_CFGR2_PPRE1_Pos));
}

/**
  * @brief  Set the APB3 bus clock prescaler (PCLK3).
  * @retval hal_rcc_pclk_prescaler_t Prescaler value
  */
hal_rcc_pclk_prescaler_t HAL_RCC_GetPCLK3Prescaler(void)
{
  return (hal_rcc_pclk_prescaler_t)(uint32_t)(LL_RCC_GetAPB3Prescaler() >> (RCC_CFGR2_PPRE3_Pos - RCC_CFGR2_PPRE1_Pos));
}

/**
  * @brief  Configure the bus dividers.
  * @param  p_config Pointer based on @ref hal_rcc_bus_clk_config_t structure
  * @warning FLASH latency must be adjusted according to the targeted system clock
  *          frequency and voltage scaling.
  * @retval HAL_OK            Success
  * @retval HAL_INVALID_PARAM Input parameter not valid (USE_HAL_CHECK_PARAM enabled)
  */
hal_status_t HAL_RCC_SetBusClockConfig(const hal_rcc_bus_clk_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != (void *)NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_RCC_HCLK(p_config->hclk_prescaler));
  ASSERT_DBG_PARAM(IS_RCC_PCLK(p_config->pclk1_prescaler));
  ASSERT_DBG_PARAM(IS_RCC_PCLK(p_config->pclk2_prescaler));
  ASSERT_DBG_PARAM(IS_RCC_PCLK(p_config->pclk3_prescaler));

  /* Configure prescalers for the available Bus */
  LL_RCC_ConfigBusClock((uint32_t)p_config->hclk_prescaler  |
                        (uint32_t)p_config->pclk1_prescaler |
                        (uint32_t)((uint32_t)p_config->pclk2_prescaler << (RCC_CFGR2_PPRE2_Pos - RCC_CFGR2_PPRE1_Pos)) |
                        (uint32_t)((uint32_t)p_config->pclk3_prescaler << (RCC_CFGR2_PPRE3_Pos - RCC_CFGR2_PPRE1_Pos)));

  return HAL_OK;
}

/**
  * @brief Retrieve the bus dividers.
  * @param p_config Pointer on @ref hal_rcc_bus_clk_config_t structure
  */
void HAL_RCC_GetBusClockConfig(hal_rcc_bus_clk_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != (void *)NULL);

  /* Get Bus prescalers */
  p_config->hclk_prescaler = (hal_rcc_hclk_prescaler_t)LL_RCC_GetAHBPrescaler();
  p_config->pclk1_prescaler = (hal_rcc_pclk_prescaler_t)LL_RCC_GetAPB1Prescaler();
  p_config->pclk2_prescaler = (hal_rcc_pclk_prescaler_t)(uint32_t)(LL_RCC_GetAPB2Prescaler()
                                                                   >> (RCC_CFGR2_PPRE2_Pos - RCC_CFGR2_PPRE1_Pos));
  p_config->pclk3_prescaler = (hal_rcc_pclk_prescaler_t)(uint32_t)(LL_RCC_GetAPB3Prescaler()
                                                                   >> (RCC_CFGR2_PPRE3_Pos - RCC_CFGR2_PPRE1_Pos));
}

/**
  * @brief  Return the PSI output frequency.
  * @note   The PSI frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source.
  * @note   If PSI source is HSIDIV3, function returns values based on HSI_VALUE.
  * @note   If PSI source is HSE, function returns values based on HSE_VALUE.
  * @note   If PSI source is LSE, function returns values based on LSE.
  * @retval uint32_t PSICLK frequency in Hz
  */
uint32_t HAL_RCC_GetPSIClockFreq(void)
{

  uint32_t psiclockfreq;

  hal_rcc_psi_config_t psi_config;

  HAL_RCC_PSI_GetConfig(&psi_config);

