MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  /* Anticipate the intrinsic error when LSE is used as clock source for PSI */
  if (psi_config.psi_source == HAL_RCC_PSI_SRC_LSE)
  {
    switch (psi_config.psi_out)
    {
      case HAL_RCC_PSI_OUT_100MHZ:
        psiclockfreq = PSI_LSE_100; /* 100.016 MHz */
        break;

      case HAL_RCC_PSI_OUT_144MHZ:
        psiclockfreq = PSI_LSE_144; /* 144.015 MHz */
        break;

      case HAL_RCC_PSI_OUT_160MHZ:
        psiclockfreq = PSI_LSE_160; /* 160.006 MHz */
        break;

      default:
        psiclockfreq = PSI_LSE_160; /* 160.006 MHz */
        break;
    }
  }
  /* No error for other clock source */
  else
  {
    switch (psi_config.psi_out)
    {
      case HAL_RCC_PSI_OUT_100MHZ:
        psiclockfreq = PSI_NOT_LSE_100;  /* 100 MHz */
        break;

      case HAL_RCC_PSI_OUT_144MHZ:
        psiclockfreq = PSI_NOT_LSE_144;  /* 144 MHz */
        break;

      case HAL_RCC_PSI_OUT_160MHZ:
        psiclockfreq = PSI_NOT_LSE_160;  /* 160 MHz */
        break;

      default:
        psiclockfreq = PSI_NOT_LSE_160;  /* 160 MHz */
        break;
    }
  }

  return psiclockfreq;
}

/**
  * @brief  Return the SYSCLK frequency.
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source.
  * @note   If SYSCLK source is HSIS or HSIDIV3, function returns values based on HSI_VALUE.
  * @note   If SYSCLK source is HSE, function returns values based on HSE_VALUE.
  * @note   If SYSCLK source is PSI, function returns values based on HSE_VALUE, LSE_VALUE or HSI_VALUE
  * @note   This function can be used by the user application to compute the
  *         baudrate for the communication peripherals or configure other parameters.
  * @warning Each time SYSCLK changes, this function must be called to update the
  *          right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
  * @retval uint32_t SYSCLK frequency in Hz
  */
uint32_t HAL_RCC_GetSYSCLKFreq(void)
{
  uint32_t sysclockfreq;
  uint32_t sysclk_source;

  sysclk_source = LL_RCC_GetSysClkSource();

  if (sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSIS)
  {
    /* HSIS used as system clock source */
    sysclockfreq = HSI_VALUE;
  }
  else if (sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSIDIV3)
  {
    /* HSIS used as system clock source */
    sysclockfreq = HSI_VALUE / 3U;
  }
#if defined(HSE_VALUE)
  else if (sysclk_source == LL_RCC_SYS_CLKSOURCE_STATUS_HSE)
  {
    /* HSE used as system clock source */
    sysclockfreq = HSE_VALUE;
  }
#endif /* HSE_VALUE */
  else
  {
    sysclockfreq = HAL_RCC_GetPSIClockFreq();
  }
  return sysclockfreq;
}

/**
  * @brief  Return the HCLK frequency.
  * @warning Each time HCLK changes, this function must be called to update the
  *          right HCLK value. Otherwise, any configuration based on this function will be incorrect.
  * @retval uint32_t HCLK frequency in Hz
  */
uint32_t HAL_RCC_GetHCLKFreq(void)
{
  return HAL_RCC_GetSYSCLKFreq() >> AHBPrescTable[LL_RCC_GetAHBPrescaler()];
}

/**
  * @brief  Return the PCLK1 frequency.
  * @warning Each time PCLK1 changes, this function must be called to update the
  *          right PCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval uint32_t PCLK1 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK1Freq(void)
{
  /* Get HCLK source and Compute PCLK1 frequency */
  return (HAL_RCC_GetHCLKFreq() >> APBPrescTable[LL_RCC_GetAPB1Prescaler() >> RCC_CFGR2_PPRE1_Pos]);
}

/**
  * @brief  Return the PCLK2 frequency.
  * @warning Each time PCLK2 changes, this function must be called to update the
  *          right PCLK2 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval uint32_t PCLK2 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK2Freq(void)
{
  /* Get HCLK source and Compute PCLK2 frequency */
  return (HAL_RCC_GetHCLKFreq() >> APBPrescTable[LL_RCC_GetAPB2Prescaler() >> RCC_CFGR2_PPRE2_Pos]);
}

/**
  * @brief  Return the PCLK3 frequency.
  * @warning Each time PCLK3 changes, this function must be called to update the
  *          right PCLK3 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval uint32_t PCLK3 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK3Freq(void)
{
  /* Get HCLK source and Compute PCLK2 frequency */
  return (HAL_RCC_GetHCLKFreq() >> APBPrescTable[LL_RCC_GetAPB3Prescaler() >> RCC_CFGR2_PPRE3_Pos]);
}

/**
  * @}
  */ /* RCC_Exported_Functions_Group1_2 */
/**
  * @}
  */ /* RCC_Exported_Functions_Group1 */

/** @addtogroup RCC_Exported_Functions_Group3
  * @{
  */

/**
  * @brief  Select the clock source to output on MCO pin.
  * @param  mcox_src       specifies the clock source to output.
  * @param  mco_prescaler  specifies the MCO prescaler.
  * @warning MCO selected pin must be configured in alternate function mode.
  */
void HAL_RCC_SetConfigMCO(hal_rcc_mco_src_t mcox_src, hal_rcc_mco_prescaler_t mco_prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_MCOSOURCE(mcox_src));
  ASSERT_DBG_PARAM(IS_RCC_MCOPRE(mco_prescaler));

  LL_RCC_ConfigMCO((uint32_t)mcox_src, (uint32_t)mco_prescaler);
}

/**
  * @brief  Get reset flags.
  * @retval uint32_t Reset flags based on a combination of @ref RCC_Reset_Flag
  */
uint32_t HAL_RCC_GetResetSource(void)
{
  uint32_t reset;

  /* Get all reset flags */
  reset = RCC->RSR & HAL_RCC_RESET_FLAG_ALL;

  return reset;
}

/**
  * @brief  Clear reset flags.
  */
void HAL_RCC_ClearResetFlags(void)
{
  LL_RCC_ForceClearResetFlags();
  LL_RCC_ReleaseClearResetFlags();
}

#if defined(HSE_VALUE)
/**
  * @brief  Enable the Clock Security System.
  * @note   If a failure is detected on the HSE oscillator clock, this oscillator
  *         is automatically disabled and an interrupt is generated to inform the
  *         software about the failure (Clock Security System Interrupt, CSS),
  *         allowing the MCU to perform rescue operations. The CSS is linked to
  *         the Cortex-M33 NMI (Non-Maskable Interrupt) exception vector.
  * @note   The Clock Security System can only be cleared by reset.
  */
void HAL_RCC_HSE_EnableCSS(void)
{
  LL_RCC_HSE_EnableCSS();
}

#endif /* HSE_VALUE */
/**
  * @brief Handle the RCC Clock Security System interrupt request.
  * @warning Call this API under the NMI_Handler().
  * @retval  HAL_OK    NMI has been managed and NMI_Handler() might exit
  * @retval  HAL_ERROR NMI has not been managed and NMI_Handler() must not exit
  */
hal_status_t HAL_RCC_NMI_IRQHandler(void)
{
  hal_status_t cb_status = HAL_ERROR;

#if defined(HSE_VALUE)
  if (LL_RCC_IsActiveFlag(LL_RCC_IT_HSECSS) != 0U)
  {
    if (HAL_RCC_HSE_CSSCallback() == HAL_OK)
    {
      LL_RCC_ClearFlag(LL_RCC_IT_HSECSS);
      cb_status = HAL_OK;
    }
  }
#endif /* HSE_VALUE */
#if defined(LSE_VALUE)
  if (LL_RCC_IsActiveFlag(LL_RCC_IT_LSECSS) != 0U)
  {
    if (HAL_RCC_LSE_CSSCallback() == HAL_OK)
    {
      LL_RCC_ClearFlag(LL_RCC_IT_LSECSS);
      cb_status = HAL_OK;
    }
  }
#endif /* LSE_VALUE */
  return cb_status;
}

#if defined(HSE_VALUE)
/**
  * @brief  RCC Clock Security System interrupt callback.
  * @retval HAL_OK    CSS error has been managed.
  * @retval HAL_ERROR CSS error has not been managed.
  */
__WEAK hal_status_t HAL_RCC_HSE_CSSCallback(void)
{
  /* NOTE : Do not modify this function, when the callback is needed,
            the HAL_RCC_HSE_CSSCallback must be implemented in the user file
   */
  /* Status to be updated to HAL_OK when the user callback managed the CSS error */
  return HAL_ERROR;
}

/**
  * @brief Set HSE Prescalers for RTC Clock.
  * @param prescaler parameter can be a value between 0 and 511 with 0 an 1 values meaning no clock output
  * @note prescaler must be correctly set to ensure that the clock supplied to the RTC is lower than 1 MHz.
  */
void  HAL_RCC_RTC_SetHSEPrescaler(uint32_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_RTC_HSEDIV(prescaler));

  LL_RCC_SetRTC_HSEPrescaler(prescaler);
}

/**
  * @brief  Get the RTC HSE prescaler.
  * @retval uint32_t Prescaler value
  */
uint32_t HAL_RCC_RTC_GetHSEPrescaler(void)
{
  return LL_RCC_GetRTC_HSEPrescaler();
}

#endif /* HSE_VALUE */
/**
  * @brief   Configure the oscillator clock source for wakeup from Stop and CSS backup clock.
  * @param   wakeup_clk  Wakeup clock
  *          This parameter can be one of the following values:
  *            @arg @ref HAL_RCC_STOP_WAKEUPCLOCK_HSIS  HSI clock selection
  *            @arg @ref HAL_RCC_STOP_WAKEUPCLOCK_HSIDIV3  HSI/3 clock selection
  * @warning Do not call this function after the Clock Security System on HSE has been enabled.
  */
void HAL_RCC_SetClockAfterWakeFromStop(hal_rcc_stop_wakeup_clk_t wakeup_clk)
{
  ASSERT_DBG_PARAM(IS_RCC_STOP_WAKEUPCLOCK(wakeup_clk));

  LL_RCC_SetClkAfterWakeFromStop((uint32_t)wakeup_clk);
}

/**
  * @brief   Get the oscillator clock source for wakeup from Stop and CSS backup clock.
  * @retval  HAL_RCC_STOP_WAKEUPCLOCK_HSIS  HSI clock selection.
  * @retval  HAL_RCC_STOP_WAKEUPCLOCK_HSIDIV3  HSI/3 clock selection.
  */
hal_rcc_stop_wakeup_clk_t HAL_RCC_GetClockAfterWakeFromStop(void)
{
  return (hal_rcc_stop_wakeup_clk_t)LL_RCC_GetClkAfterWakeFromStop();
}

#if defined(LSE_VALUE)
/**
  * @brief  Enable the LSE Clock Security System.
  * @note   Prior to enable the LSE Clock Security System, LSE oscillator is to be enabled
  *         with HAL_RCC_LSE_Enable() and the LSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCC_RTC_SetKernelClkSource().
  */
void HAL_RCC_LSE_EnableCSS(void)
{
  LL_RCC_LSE_EnableCSS();
}

/**
  * @brief  Disable the LSE Clock Security System.
  * @note   LSE Clock Security System can only be disabled after a LSE failure detection.
  */
void HAL_RCC_LSE_DisableCSS(void)
{
  LL_RCC_LSE_DisableCSS();
}

/**
  * @brief  RCC LSE Clock Security System interrupt callback.
  * @retval HAL_OK    CSS error has been managed.
  * @retval HAL_ERROR CSS error has not been managed.
  */
__WEAK hal_status_t HAL_RCC_LSE_CSSCallback(void)
{
  /* NOTE : Do not modify this function, when the callback is needed,
            the @ref HAL_RCC_LSE_CSSCallback must be implemented in the user file
   */
  /* Status to be updated to HAL_OK when the user callback managed the LSECSS error */
  return HAL_ERROR;
}

#endif /* LSE_VALUE */
/**
  * @brief   Select source clock to use on the Low Speed Clock Output (LSCO).
  * @param   source  specifies the Low Speed clock source to output.
  * @note    PWR and backup domain are to be enabled before calling this function.
  * @retval  HAL_OK      LSCO activated
  * @retval  HAL_ERROR   Backup domain is not enabled
  */
hal_status_t HAL_RCC_EnableLSCO(hal_rcc_lsco_src_t source)
{
  ASSERT_DBG_PARAM(IS_RCC_LSCOSOURCE(source));

  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

  LL_RCC_ConfigLSCO((uint32_t)source);

  LL_RCC_LSCO_Enable();

  return HAL_OK;
}

/**
  * @brief  Disable the Low Speed Clock Output (LSCO).
  * @note   PWR and backup domain are to be enabled before calling this function.
  * @retval HAL_OK      LSCO Deactivated
  * @retval HAL_ERROR   LSCO is not disabled
  */
hal_status_t HAL_RCC_DisableLSCO(void)
{
  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

  LL_RCC_LSCO_Disable();

  return HAL_OK;
}

/**
  * @brief Enable RTC and TAMP kernel clock.
  * @note  PWR and backup domain are to be enabled before calling this function.
  * @retval HAL_OK      RTC and TAMP kernel clock enabled
  * @retval HAL_ERROR   Backup domain is not enabled
  */
hal_status_t HAL_RCC_RTC_EnableKernelClock(void)
{
  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

