MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  LL_RCC_EnableRTC();

  return HAL_OK;
}

/**
  * @brief Disable RTC and TAMP kernel clock.
  * @note  PWR and backup domain are to be enabled before calling this function.
  * @retval HAL_OK      RTC and TAMP kernel clock disabled
  * @retval HAL_ERROR   Backup domain is not disabled
  */
hal_status_t HAL_RCC_RTC_DisableKernelClock(void)
{
  if (LL_PWR_IsEnabledRTCDomainWriteProtection() != 0U)
  {
    return HAL_ERROR;
  }

  LL_RCC_DisableRTC();

  return HAL_OK;
}
/**
  * @}
  */ /* RCC_Exported_Functions_Group3 */

/** @addtogroup RCC_Exported_Functions_Group4
  * @{
  */
/**
  * @brief  Set the USART1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_usart1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_USART1_SetKernelClkSource(hal_rcc_usart1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_USART1_CLK(clk_src));

  LL_RCC_SetUSARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the USART2 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_usart2_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_USART2_SetKernelClkSource(hal_rcc_usart2_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_USART2_CLK(clk_src));

  LL_RCC_SetUSARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(USART3)
/**
  * @brief  Set the USART3 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_usart3_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_USART3_SetKernelClkSource(hal_rcc_usart3_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_USART3_CLK(clk_src));

  LL_RCC_SetUSARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* USART3 */
/**
  * @brief  Set the UART4 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_uart4_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_UART4_SetKernelClkSource(hal_rcc_uart4_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_UART4_CLK(clk_src));

  LL_RCC_SetUARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the UART5 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_uart5_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_UART5_SetKernelClkSource(hal_rcc_uart5_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_UART5_CLK(clk_src));

  LL_RCC_SetUARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(USART6)
/**
  * @brief  Set the USART6 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_usart6_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_USART6_SetKernelClkSource(hal_rcc_usart6_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_USART6_CLK(clk_src));

  LL_RCC_SetUSARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* USART6 */
#if defined(UART7)
/**
  * @brief  Set the UART7 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_uart7_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_UART7_SetKernelClkSource(hal_rcc_uart7_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_UART7_CLK(clk_src));

  LL_RCC_SetUSARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* UART7 */
/**
  * @brief  Set the LPUART1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_lpuart1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_LPUART1_SetKernelClkSource(hal_rcc_lpuart1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_LPUART1_CLK(clk_src));

  LL_RCC_SetLPUARTClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the SPI1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_spi1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_SPI1_SetKernelClkSource(hal_rcc_spi1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_SPI1_CLK(clk_src));

  LL_RCC_SetSPIClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the SPI2 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_spi2_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_SPI2_SetKernelClkSource(hal_rcc_spi2_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_SPI2_CLK(clk_src));

  LL_RCC_SetSPIClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(SPI3)
/**
  * @brief  Set the SPI3 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_spi3_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_SPI3_SetKernelClkSource(hal_rcc_spi3_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_SPI3_CLK(clk_src));

  LL_RCC_SetSPIClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* SPI3 */
#if defined(FDCAN1)

/**
  * @brief  Set the FDCAN clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_fdcan_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  * @note   The FDCAN clock is common for all FDCAN instances
  */
hal_status_t HAL_RCC_FDCAN_SetKernelClkSource(hal_rcc_fdcan_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_FDCAN_CLK(clk_src));

  LL_RCC_SetFDCANClockSource((uint32_t)clk_src);
  return HAL_OK;
}
#endif /* FDCAN1 */

/**
  * @brief  Set the I2C1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_i2c1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_I2C1_SetKernelClkSource(hal_rcc_i2c1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_I2C1_CLK(clk_src));

  LL_RCC_SetI2CClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(I2C2)
/**
  * @brief  Set the I2C2 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_i2c2_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_I2C2_SetKernelClkSource(hal_rcc_i2c2_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_I2C2_CLK(clk_src));

  LL_RCC_SetI2CClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* I2C2 */
/**
  * @brief  Set the I3C1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_i3c1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_I3C1_SetKernelClkSource(hal_rcc_i3c1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_I3C1_CLK(clk_src));

