MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  LL_RCC_SetI3CClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the ADCDAC clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_adcdac_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  * @note This bit must not be changed when ADC or DAC enabled.
  */
hal_status_t HAL_RCC_ADCDAC_SetKernelClkSource(hal_rcc_adcdac_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_ADCDAC_CLK(clk_src));

  LL_RCC_SetADCDACClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the DAC1 sample and hold clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_dac1_sh_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_DAC1_SetSampleHoldClkSource(hal_rcc_dac1_sh_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_DAC1_SH_CLK(clk_src));

  LL_RCC_SetDACSHClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(LPTIM1)
/**
  * @brief  Set the LPTIM1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_lptim1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_LPTIM1_SetKernelClkSource(hal_rcc_lptim1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_LPTIM1_CLK(clk_src));

  LL_RCC_SetLPTIMClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* LPTIM1 */
/**
  * @brief  Set the CK48 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_ck48_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_CK48_SetKernelClkSource(hal_rcc_ck48_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_CK48_CLK(clk_src));

  LL_RCC_SetCK48ClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#if defined(XSPI1)
/**
  * @brief  Set the XSPI1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_xspi1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_XSPI1_SetKernelClkSource(hal_rcc_xspi1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_XSPI1_CLK(clk_src));

  LL_RCC_SetXSPIClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief  Set the ETH1REF clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_eth1ref_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_ETH1REF_SetKernelClkSource(hal_rcc_eth1ref_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1REF_CLK(clk_src));

  LL_RCC_SetETH1ClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the ETH1 PTP clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_eth1ptp_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_ETH1PTP_SetKernelClkSource(hal_rcc_eth1ptp_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1PTP_CLK(clk_src));

  LL_RCC_SetETH1ClockSource((uint32_t)clk_src);
  return HAL_OK;
}

/**
  * @brief  Set the ETH1 clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_eth1_clk_src_t
  * @retval HAL_OK    Source clock has been selected
  */
hal_status_t HAL_RCC_ETH1_SetKernelClkSource(hal_rcc_eth1_clk_src_t clk_src)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1_CLK(clk_src));

  LL_RCC_SetETH1ClockSource((uint32_t)clk_src);
  return HAL_OK;
}

#endif /* ETH1 */
/**
  * @brief  Set the RTC clock source.
  * @param  clk_src Clock source selection based on @ref hal_rcc_rtc_clk_src_t
  * @warning Backup domain write access must be enabled before calling this function.
  * @warning Modifying the RTC clock source after it has been configured requires
  *          performing an RTC domain reset first.
  * @retval HAL_OK    RTC source clock has been selected
  * @retval HAL_ERROR RTC source clock has not been selected
  */
hal_status_t HAL_RCC_RTC_SetKernelClkSource(hal_rcc_rtc_clk_src_t clk_src)
{

  ASSERT_DBG_PARAM(IS_RCC_RTC_CLK(clk_src));

  /* Apply new RTC clock source selection */
  LL_RCC_SetRTCClockSource((uint32_t)clk_src);

  /* Check that the clock source has been changed */
  if (LL_RCC_GetRTCClockSource() != (uint32_t)clk_src)
  {
    return HAL_ERROR;
  }
  else
  {
    return HAL_OK;
  }
}

/**
  * @brief  Get the USART1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_usart1_clk_src_t
  */
hal_rcc_usart1_clk_src_t HAL_RCC_USART1_GetKernelClkSource(void)
{
  return (hal_rcc_usart1_clk_src_t)LL_RCC_GetUSARTClockSource(LL_RCC_USART1_CLKSOURCE);
}

/**
  * @brief  Get the USART2 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_usart2_clk_src_t
  */
hal_rcc_usart2_clk_src_t HAL_RCC_USART2_GetKernelClkSource(void)
{
  return (hal_rcc_usart2_clk_src_t)LL_RCC_GetUSARTClockSource(LL_RCC_USART2_CLKSOURCE);
}

#if defined(USART3)
/**
  * @brief  Get the USART3 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_usart3_clk_src_t
  */
hal_rcc_usart3_clk_src_t HAL_RCC_USART3_GetKernelClkSource(void)
{
  return (hal_rcc_usart3_clk_src_t)LL_RCC_GetUSARTClockSource(LL_RCC_USART3_CLKSOURCE);
}

#endif /* USART3 */
/**
  * @brief  Get the UART4 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_uart4_clk_src_t
  */
hal_rcc_uart4_clk_src_t HAL_RCC_UART4_GetKernelClkSource(void)
{
  return (hal_rcc_uart4_clk_src_t)LL_RCC_GetUARTClockSource(LL_RCC_UART4_CLKSOURCE);
}

/**
  * @brief  Get the UART5 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_uart5_clk_src_t
  */
hal_rcc_uart5_clk_src_t HAL_RCC_UART5_GetKernelClkSource(void)
{
  return (hal_rcc_uart5_clk_src_t)LL_RCC_GetUARTClockSource(LL_RCC_UART5_CLKSOURCE);
}

#if defined(USART6)
/**
  * @brief  Get the USART6 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_usart6_clk_src_t
  */
hal_rcc_usart6_clk_src_t HAL_RCC_USART6_GetKernelClkSource(void)
{
  return (hal_rcc_usart6_clk_src_t)LL_RCC_GetUSARTClockSource(LL_RCC_USART6_CLKSOURCE);
}

#endif /* USART6 */
#if defined(UART7)
/**
  * @brief  Get the UART7 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_uart7_clk_src_t
  */
hal_rcc_uart7_clk_src_t HAL_RCC_UART7_GetKernelClkSource(void)
{
  return (hal_rcc_uart7_clk_src_t)LL_RCC_GetUARTClockSource(LL_RCC_UART7_CLKSOURCE);
}

#endif /* UART7 */
/**
  * @brief  Get the LPUART1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_lpuart1_clk_src_t
  */
hal_rcc_lpuart1_clk_src_t HAL_RCC_LPUART1_GetKernelClkSource(void)
{
  return (hal_rcc_lpuart1_clk_src_t)LL_RCC_GetLPUARTClockSource(LL_RCC_LPUART1_CLKSOURCE);
}

/**
  * @brief  Get the SPI1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_spi1_clk_src_t
  */
hal_rcc_spi1_clk_src_t HAL_RCC_SPI1_GetKernelClkSource(void)
{
  return (hal_rcc_spi1_clk_src_t)LL_RCC_GetSPIClockSource(LL_RCC_SPI1_CLKSOURCE);
}

/**
  * @brief  Get the SPI2 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_spi2_clk_src_t
  */
hal_rcc_spi2_clk_src_t HAL_RCC_SPI2_GetKernelClkSource(void)
{
  return (hal_rcc_spi2_clk_src_t)LL_RCC_GetSPIClockSource(LL_RCC_SPI2_CLKSOURCE);
}

