MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
#if defined(SPI3)
/**
  * @brief  Get the SPI3 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_spi3_clk_src_t
  */
hal_rcc_spi3_clk_src_t HAL_RCC_SPI3_GetKernelClkSource(void)
{
  return (hal_rcc_spi3_clk_src_t)LL_RCC_GetSPIClockSource(LL_RCC_SPI3_CLKSOURCE);
}

#endif /* SPI3 */
#if defined(FDCAN1)

/**
  * @brief  Get the FDCAN clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_fdcan_clk_src_t
  * @note   The FDCAN clock is common for all FDCAN instances
  */
hal_rcc_fdcan_clk_src_t HAL_RCC_FDCAN_GetKernelClkSource(void)
{
  return (hal_rcc_fdcan_clk_src_t)LL_RCC_GetFDCANClockSource(LL_RCC_FDCAN_CLKSOURCE);
}
#endif /* FDCAN1 */

/**
  * @brief  Get the I2C1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_i2c1_clk_src_t
  */
hal_rcc_i2c1_clk_src_t HAL_RCC_I2C1_GetKernelClkSource(void)
{
  return (hal_rcc_i2c1_clk_src_t)LL_RCC_GetI2CClockSource(LL_RCC_I2C1_CLKSOURCE);
}

#if defined(I2C2)
/**
  * @brief  Get the I2C2 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_i2c2_clk_src_t
  */
hal_rcc_i2c2_clk_src_t HAL_RCC_I2C2_GetKernelClkSource(void)
{
  return (hal_rcc_i2c2_clk_src_t)LL_RCC_GetI2CClockSource(LL_RCC_I2C2_CLKSOURCE);
}

#endif /* I2C2 */
/**
  * @brief  Get the I3C1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_i3c1_clk_src_t
  */
hal_rcc_i3c1_clk_src_t HAL_RCC_I3C1_GetKernelClkSource(void)
{
  return (hal_rcc_i3c1_clk_src_t)LL_RCC_GetI3CClockSource(LL_RCC_I3C1_CLKSOURCE);
}

/**
  * @brief  Get the ADCDAC clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_adcdac_clk_src_t
  */
hal_rcc_adcdac_clk_src_t HAL_RCC_ADCDAC_GetKernelClkSource(void)
{
  return (hal_rcc_adcdac_clk_src_t)LL_RCC_GetADCDACClockSource(LL_RCC_ADCDAC_CLKSOURCE);
}

/**
  * @brief  Get the DAC1 sample and hold clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_dac1_sh_clk_src_t
  */
hal_rcc_dac1_sh_clk_src_t HAL_RCC_DAC1_GetSampleHoldClkSource(void)
{
  return (hal_rcc_dac1_sh_clk_src_t)LL_RCC_GetDACSHClockSource(LL_RCC_DAC1SH_CLKSOURCE);
}

#if defined(LPTIM1)
/**
  * @brief  Get the LPTIM1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_lptim1_clk_src_t
  */
hal_rcc_lptim1_clk_src_t HAL_RCC_LPTIM1_GetKernelClkSource(void)
{
  return (hal_rcc_lptim1_clk_src_t)LL_RCC_GetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE);
}

#endif /* LPTIM1 */
/**
  * @brief  Get the CK48 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_ck48_clk_src_t
  */
hal_rcc_ck48_clk_src_t HAL_RCC_CK48_GetKernelClkSource(void)
{
  return (hal_rcc_ck48_clk_src_t)LL_RCC_GetCKClockSource(LL_RCC_CK48_CLKSOURCE);
}

#if defined(XSPI1)
/**
  * @brief  Get the XSPI1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_xspi1_clk_src_t
  */
hal_rcc_xspi1_clk_src_t HAL_RCC_XSPI1_GetKernelClkSource(void)
{
  return (hal_rcc_xspi1_clk_src_t)LL_RCC_GetXSPIClockSource(LL_RCC_XSPI1_CLKSOURCE);
}

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief  Get the ETH1 REF clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_eth1ref_clk_src_t
  */
hal_rcc_eth1ref_clk_src_t HAL_RCC_ETH1REF_GetKernelClkSource(void)
{
  return (hal_rcc_eth1ref_clk_src_t)LL_RCC_GetETH1ClockSource(LL_RCC_ETH1REF_CLKSOURCE);
}

/**
  * @brief  Get the ETH1 PTP clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_eth1ptp_clk_src_t
  */
hal_rcc_eth1ptp_clk_src_t HAL_RCC_ETH1PTP_GetKernelClkSource(void)
{
  return (hal_rcc_eth1ptp_clk_src_t)LL_RCC_GetETH1ClockSource(LL_RCC_ETH1PTP_CLKSOURCE);
}

/**
  * @brief  Get the ETH1 clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_eth1_clk_src_t
  */
hal_rcc_eth1_clk_src_t HAL_RCC_ETH1_GetKernelClkSource(void)
{
  return (hal_rcc_eth1_clk_src_t)LL_RCC_GetETH1ClockSource(LL_RCC_ETH1_CLKSOURCE);
}

#endif /* ETH1 */
/**
  * @brief  Get the RTC clock source.
  * @retval clk_src Clock source based on @ref hal_rcc_rtc_clk_src_t
  */
hal_rcc_rtc_clk_src_t HAL_RCC_RTC_GetKernelClkSource(void)
{
  return (hal_rcc_rtc_clk_src_t)LL_RCC_GetRTCClockSource();
}

/**
  * @brief  Set the ADCDAC prescaler.
  * @param  prescaler  Prescaler selection based on @ref hal_rcc_adcdac_prescaler_t
  * @retval HAL_OK     Prescaler has been selected
  * @note This bit must not be changed when ADC or DAC enabled.
  */
hal_status_t HAL_RCC_ADCDAC_SetKernelClkPrescaler(hal_rcc_adcdac_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ADCDAC_PRESCALER(prescaler));

  LL_RCC_SetADCDACPrescaler((uint32_t)prescaler);
  return HAL_OK;
}

/**
  * @brief  Get the ADCDAC prescaler.
  * @retval value based on @ref hal_rcc_adcdac_prescaler_t
  */
hal_rcc_adcdac_prescaler_t HAL_RCC_ADCDAC_GetKernelClkPrescaler(void)
{

  return (hal_rcc_adcdac_prescaler_t)LL_RCC_GetADCDACPrescaler(ADC1_BASE);
}

/**
  * @brief  Set the ADCDAC Clock source and prescaler.
  * @param  clk_src Clock source selection based on @ref hal_rcc_adcdac_clk_src_t
  * @param  prescaler Prescaler selection based on @ref hal_rcc_adcdac_prescaler_t
  * @note   Clock source and prescaler can be updated only if ADCDAC is disabled
  * @retval HAL_OK     Clock source and prescaler has been selected
  *         HAL_ERROR  ADCDAC is enabled
  */
hal_status_t HAL_RCC_ADCDAC_SetConfigKernelClk(hal_rcc_adcdac_clk_src_t clk_src, hal_rcc_adcdac_prescaler_t prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ADCDAC_CLK(clk_src));
  ASSERT_DBG_PARAM(IS_RCC_ADCDAC_PRESCALER(prescaler));

#if defined(ADC3)
  if ((LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_ADC12) == 1U)
      || (LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_ADC3) == 1U))
#else
  if (LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_ADC12) == 1U)
#endif /* ADC3 */
  {
    return HAL_ERROR;
  }
  else
  {
    LL_RCC_ConfigADCDAC((uint32_t)clk_src, (uint32_t)prescaler);
  }
  return HAL_OK;
}

/**
  * @brief  Get the ADCDAC Clock source and prescaler.
  * @param  p_clk_src Pointer on @ref hal_rcc_adcdac_clk_src_t
  * @param  p_prescaler Pointer on @ref hal_rcc_adcdac_prescaler_t
  */
void HAL_RCC_ADCDAC_GetConfigKernelClk(hal_rcc_adcdac_clk_src_t *p_clk_src, hal_rcc_adcdac_prescaler_t *p_prescaler)
{
  ASSERT_DBG_PARAM(p_clk_src != (void *)NULL);
  ASSERT_DBG_PARAM(p_prescaler != (void *)NULL);

