MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  uint32_t clk_src;
  uint32_t prescaler;

  /* Get ADC clock source and prescaler */
  LL_RCC_GetConfigADCDAC(&clk_src, &prescaler);

  *p_clk_src = (hal_rcc_adcdac_clk_src_t)clk_src;
  *p_prescaler = (hal_rcc_adcdac_prescaler_t)prescaler;
}

#if defined(ETH1)
/**
  * @brief  Set the ETH1 prescaler.
  * @param  eth_prescaler Prescaler selection based on @ref hal_rcc_eth1_prescaler_t
  * @retval HAL_OK        Prescaler has been selected
  */
hal_status_t HAL_RCC_ETH1_SetKernelClkPrescaler(hal_rcc_eth1_prescaler_t eth_prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1_PRESCALER(eth_prescaler));

  LL_RCC_SetETH1Prescaler((uint32_t)eth_prescaler);
  return HAL_OK;
}

/**
  * @brief  Get the ETH1 prescaler.
  * @retval value based on @ref hal_rcc_eth1_prescaler_t
  */
hal_rcc_eth1_prescaler_t HAL_RCC_ETH1_GetKernelClkPrescaler(void)
{

  return (hal_rcc_eth1_prescaler_t)LL_RCC_GetETH1Prescaler();
}

/**
  * @brief  Set the ETH1 Clock source and prescaler.
  * @param  clk_src Clock source selection based on @ref hal_rcc_eth1_clk_src_t
  * @param  eth_prescaler Prescaler selection based on @ref hal_rcc_eth1_prescaler_t
  * @note   Clock source and prescaler can be updated only if ETH1 is disabled
  * @retval HAL_OK     Clock source and prescaler has been selected
  */
hal_status_t HAL_RCC_ETH1_SetConfigKernelClk(hal_rcc_eth1_clk_src_t clk_src, hal_rcc_eth1_prescaler_t eth_prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1_CLK(clk_src));
  ASSERT_DBG_PARAM(IS_RCC_ETH1_PRESCALER(eth_prescaler));

  LL_RCC_ConfigETH1((uint32_t)clk_src, (uint32_t)eth_prescaler);
  return HAL_OK;
}

/**
  * @brief  Get the ETH1 Clock source and prescaler.
  * @param  p_clk_src Pointer on @ref hal_rcc_eth1_clk_src_t
  * @param  p_prescaler Pointer on @ref hal_rcc_eth1_prescaler_t
  */
void HAL_RCC_ETH1_GetConfigKernelClk(hal_rcc_eth1_clk_src_t *p_clk_src, hal_rcc_eth1_prescaler_t *p_prescaler)
{
  ASSERT_DBG_PARAM(p_clk_src != (void *)NULL);
  ASSERT_DBG_PARAM(p_prescaler != (void *)NULL);

  uint32_t clk_src;
  uint32_t prescaler;

  /* Get ETH1 clock source and prescaler */
  LL_RCC_GetConfigETH1(&clk_src, &prescaler);

  *p_clk_src = (hal_rcc_eth1_clk_src_t)clk_src;
  *p_prescaler = (hal_rcc_eth1_prescaler_t)prescaler;
}

/**
  * @brief  Set the ETH1PTP prescaler.
  * @param  ethptp_prescaler can be a value between 1 and 16
  * @retval HAL_OK Prescaler has been selected
  */
hal_status_t HAL_RCC_ETH1PTP_SetKernelClkPrescaler(uint32_t ethptp_prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1PTP_PRESCALER(ethptp_prescaler));

  LL_RCC_SetETH1PTPPrescaler((uint32_t)ethptp_prescaler);
  return HAL_OK;
}

/**
  * @brief  Get the ETH1PTP prescaler.
  * @retval Prescaler parameter can be a value between 1 and 16
  */
uint32_t HAL_RCC_ETH1PTP_GetKernelClkPrescaler(void)
{

  return LL_RCC_GetETH1PTPPrescaler();
}

/**
  * @brief  Set the eth1ptp PTP Clock source and prescaler.
  * @param  clk_src Clock source selection based on @ref hal_rcc_eth1ptp_clk_src_t
  * @param  ethptp_prescaler parameter can be a value between 1 and 16
  * @note   Clock source and prescaler can be updated only if eth1ptp PTP is disabled
  * @retval HAL_OK     Clock source and prescaler has been selected
  */
hal_status_t HAL_RCC_ETH1PTP_SetConfigKernelClk(hal_rcc_eth1ptp_clk_src_t clk_src, uint32_t ethptp_prescaler)
{
  ASSERT_DBG_PARAM(IS_RCC_ETH1PTP_CLK(clk_src));
  ASSERT_DBG_PARAM(IS_RCC_ETH1PTP_PRESCALER(ethptp_prescaler));

  LL_RCC_ConfigETH1PTP((uint32_t)clk_src, ethptp_prescaler);
  return HAL_OK;
}

/**
  * @brief  Get the ETH1PTP Clock source and prescaler.
  * @param  p_clk_src Pointer on @ref hal_rcc_eth1ptp_clk_src_t
  * @param  p_prescaler Pointer on prescaler value
  */
void HAL_RCC_ETH1PTP_GetConfigKernelClk(hal_rcc_eth1ptp_clk_src_t *p_clk_src, uint32_t *p_prescaler)
{
  ASSERT_DBG_PARAM(p_clk_src != (void *)NULL);
  ASSERT_DBG_PARAM(p_prescaler != (void *)NULL);

  uint32_t clk_src;
  uint32_t prescaler;

  /* Get ETH1PTP clock source and prescaler */
  LL_RCC_GetConfigETH1PTP(&clk_src, &prescaler);

  *p_clk_src = (hal_rcc_eth1ptp_clk_src_t)clk_src;
  *p_prescaler = prescaler;
}

#endif /* ETH1 */
/**
  * @brief  Return the peripheral clock frequency for UART/USART/LPUART.
  * @param  uartx UART instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_UART_GetKernelClkFreq(const USART_TypeDef *uartx)
{
  uint32_t frequency = 0U;

  switch ((uint32_t)uartx)
  {
    case (uint32_t)USART1:
      frequency = HAL_RCC_USART1_GetKernelClkFreq();
      break;

#if defined(USART2)
    case (uint32_t)USART2:
      frequency = HAL_RCC_USART2_GetKernelClkFreq();
      break;

#endif /* USART2 */
#if defined(USART3)
    case (uint32_t)USART3:
      frequency = HAL_RCC_USART3_GetKernelClkFreq();
      break;

#endif /* USART3 */
    case (uint32_t)UART4:
      frequency = HAL_RCC_UART4_GetKernelClkFreq();
      break;

    case (uint32_t)UART5:
      frequency = HAL_RCC_UART5_GetKernelClkFreq();
      break;

#if defined(USART6)
    case (uint32_t)USART6:
      frequency = HAL_RCC_USART6_GetKernelClkFreq();
      break;

#endif /* USART6 */

#if defined(UART7)
    case (uint32_t)UART7:
      frequency = HAL_RCC_UART7_GetKernelClkFreq();
      break;

#endif /* UART7 */
    case (uint32_t)LPUART1:
      frequency = HAL_RCC_LPUART1_GetKernelClkFreq();
      break;

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for USART1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_USART1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk;

  srcclk = LL_RCC_GetUSARTClockSource(LL_RCC_USART1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_USART1_CLKSOURCE_PCLK2:
      frequency = HAL_RCC_GetPCLK2Freq();
      break;

    case LL_RCC_USART1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

