MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
    case LL_RCC_USART1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) /  RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_USART1_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;

#endif /* LSE_VALUE */
    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for USART2.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_USART2_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUSARTClockSource(LL_RCC_USART2_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_USART2_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_USART2_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_USART2_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_USART2_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

#if defined(USART3)
/**
  * @brief  Return the peripheral clock frequency for USART3.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_USART3_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUSARTClockSource(LL_RCC_USART3_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_USART3_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_USART3_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_USART3_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_USART3_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

#endif /* USART3 */
/**
  * @brief  Return the peripheral clock frequency for UART4.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_UART4_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUARTClockSource(LL_RCC_UART4_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_UART4_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_UART4_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_UART4_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_UART4_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for UART5.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_UART5_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUARTClockSource(LL_RCC_UART5_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_UART5_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_UART5_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_UART5_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_UART5_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

#if defined(USART6)
/**
  * @brief  Return the peripheral clock frequency for USART6.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_USART6_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUARTClockSource(LL_RCC_USART6_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_USART6_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_USART6_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_USART6_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_USART6_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

#endif /* USART6 */
#if defined(UART7)
/**
  * @brief  Return the peripheral clock frequency for UART7.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_UART7_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetUARTClockSource(LL_RCC_UART7_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_UART7_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_UART7_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_UART7_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_UART7_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

