MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  return frequency;
}

#endif /* UART7 */
/**
  * @brief  Return the peripheral clock frequency for LPUART1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_LPUART1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetLPUARTClockSource(LL_RCC_LPUART1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_LPUART1_CLKSOURCE_PCLK3:
      frequency = HAL_RCC_GetPCLK3Freq();
      break;

    case LL_RCC_LPUART1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_LPUART1_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    case LL_RCC_LPUART1_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        frequency = LSI_VALUE;
      }
      break;

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for USART/SMARTCARD.
  * @param  usartx USART instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_USART_GetKernelClkFreq(const USART_TypeDef *usartx)
{
  uint32_t frequency = 0;

  switch ((uint32_t)usartx)
  {
    case (uint32_t)USART1:
      frequency = HAL_RCC_USART1_GetKernelClkFreq();
      break;

#if defined(USART2)
    case (uint32_t)USART2:
      frequency = HAL_RCC_USART2_GetKernelClkFreq();
      break;
#endif /* USART2 */

#if defined(USART3)
    case (uint32_t)USART3:
      frequency = HAL_RCC_USART3_GetKernelClkFreq();
      break;
#endif /* USART3 */

#if defined(USART6)
    case (uint32_t)USART6:
      frequency = HAL_RCC_USART6_GetKernelClkFreq();
      break;
#endif /* USART6 */

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for SPI.
  * @param  spix SPI instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_SPI_GetKernelClkFreq(const SPI_TypeDef *spix)
{
  uint32_t frequency = 0;

  switch ((uint32_t)spix)
  {
    case (uint32_t)SPI1:
      frequency = HAL_RCC_SPI1_GetKernelClkFreq();
      break;

    case (uint32_t)SPI2:
      frequency = HAL_RCC_SPI2_GetKernelClkFreq();
      break;

#if defined(SPI3)
    case (uint32_t)SPI3:
      frequency = HAL_RCC_SPI3_GetKernelClkFreq();
      break;

#endif /* SPI3 */
    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for SPI1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_SPI1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetSPIClockSource(LL_RCC_SPI1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_SPI1_CLKSOURCE_PCLK2:
      frequency = HAL_RCC_GetPCLK2Freq();
      break;

    case LL_RCC_SPI1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_SPI1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(AUDIO_CLOCK_VALUE)
    case LL_RCC_SPI1_CLKSOURCE_AUDIOCLK:
      frequency = AUDIO_CLOCK_VALUE;
      break;
#endif /* AUDIO_CLOCK_VALUE */

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for SPI2.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_SPI2_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetSPIClockSource(LL_RCC_SPI2_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_SPI2_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_SPI2_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_SPI2_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(AUDIO_CLOCK_VALUE)
    case LL_RCC_SPI2_CLKSOURCE_AUDIOCLK:
      frequency = AUDIO_CLOCK_VALUE;
      break;
#endif /* AUDIO_CLOCK_VALUE */

    default:
      break;
  }

  return frequency;
}

#if defined(SPI3)
/**
  * @brief  Return the peripheral clock frequency for SPI3.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_SPI3_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetSPIClockSource(LL_RCC_SPI3_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_SPI3_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_SPI3_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_SPI3_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

#if defined(AUDIO_CLOCK_VALUE)
    case LL_RCC_SPI3_CLKSOURCE_AUDIOCLK:
      frequency = AUDIO_CLOCK_VALUE;
      break;
#endif /* AUDIO_CLOCK_VALUE */

    default:
      break;
  }

  return frequency;
}

#endif /* SPI3 */
#if defined(FDCAN1)

/**
  * @brief  Return the peripheral clock frequency for FDCAN.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  * @note   The FDCAN clock is common for all FDCAN instances
  */
uint32_t HAL_RCC_FDCAN_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetFDCANClockSource(LL_RCC_FDCAN_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_FDCAN_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

