MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
    case LL_RCC_FDCAN_CLKSOURCE_PSIS:
      if (LL_RCC_PSIS_IsReady() != 0U)
      {
        frequency = HAL_RCC_GetPSIClockFreq();
      }
      break;

    case LL_RCC_FDCAN_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

#if defined(HSE_VALUE)
    case LL_RCC_FDCAN_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        frequency = HSE_VALUE;
      }
      break;
#endif /* HSE_VALUE */

    default:
      break;
  }

  return frequency;
}
#endif /* FDCAN1 */
#if defined(LPTIM1)
/**
  * @brief  Return the peripheral clock frequency for LPTIM.
  * @param  lptimx LPTIM instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_LPTIM_GetKernelClkFreq(const LPTIM_TypeDef *lptimx)
{
  uint32_t frequency = 0;

  switch ((uint32_t)lptimx)
  {
    case (uint32_t)LPTIM1:
      frequency = HAL_RCC_LPTIM1_GetKernelClkFreq();
      break;

    default:
      break;
  }

  return frequency;
}

#endif /* LPTIM1 */
/** @brief  Return the peripheral clock frequency for TIM.
  * @param  timx TIM instance.
  * @retval uint32_t Frequency in Hz.
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t  HAL_RCC_TIM_GetKernelClkFreq(const TIM_TypeDef *timx)
{
  uint32_t frequency;

  if ((IS_TIM_APB1_INSTANCE(timx) != 0U) || (IS_TIM_APB2_INSTANCE(timx) != 0U))
  {
    frequency = HAL_RCC_GetHCLKFreq();
  }
  else
  {
    frequency = 0U;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for I2C/SMBUS.
  * @param  i2cx I2C instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_I2C_GetKernelClkFreq(const I2C_TypeDef *i2cx)
{
  uint32_t frequency = 0;

  switch ((uint32_t)i2cx)
  {
    case (uint32_t)I2C1:
      frequency = HAL_RCC_I2C1_GetKernelClkFreq();
      break;

#if defined(I2C2)
    case (uint32_t)I2C2:
      frequency = HAL_RCC_I2C2_GetKernelClkFreq();
      break;
#endif /* I2C2 */

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for I2C1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_I2C1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetI2CClockSource(LL_RCC_I2C1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_I2C1_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_I2C1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_I2C1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  return frequency;
}

#if defined(I2C2)
/**
  * @brief  Return the peripheral clock frequency for I2C2.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_I2C2_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetI2CClockSource(LL_RCC_I2C2_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_I2C2_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_I2C2_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_I2C2_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  return frequency;
}

#endif /* I2C2 */
/**
  * @brief  Return the peripheral clock frequency for I3C.
  * @param  i3cx I3C instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_I3C_GetKernelClkFreq(const I3C_TypeDef *i3cx)
{
  uint32_t frequency = 0;

  switch ((uint32_t)i3cx)
  {
    case (uint32_t)I3C1:
      frequency = HAL_RCC_I3C1_GetKernelClkFreq();
      break;

    default:
      break;
  }

  return frequency;
}


/**
  * @brief  Return the peripheral clock frequency for I3C1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_I3C1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetI3CClockSource(LL_RCC_I3C1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_I3C1_CLKSOURCE_PCLK1:
      frequency = HAL_RCC_GetPCLK1Freq();
      break;

    case LL_RCC_I3C1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_I3C1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for ADCDAC.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_ADCDAC_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetADCDACClockSource(LL_RCC_ADCDAC_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_ADCDAC_CLKSOURCE_HCLK:
      frequency = HAL_RCC_GetHCLKFreq();
      break;

    case LL_RCC_ADCDAC_CLKSOURCE_PSIS:
      if (LL_RCC_PSIS_IsReady() != 0U)
      {
        frequency = HAL_RCC_GetPSIClockFreq();
      }
      break;

