MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
    case LL_RCC_ADCDAC_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_ADCDAC_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  frequency = frequency / RCC_GET_ADC_PRESCALER();

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for DAC.
  * @param  dacx DAC instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_DAC_GetKernelClkFreq(const DAC_TypeDef *dacx)
{
  STM32_UNUSED(dacx);

  return HAL_RCC_ADCDAC_GetKernelClkFreq();
}

/**
  * @brief  Return the peripheral clock frequency for ADC.
  * @param  adcx ADC instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_ADC_GetKernelClkFreq(const ADC_TypeDef *adcx)
{
  STM32_UNUSED(adcx);

  return HAL_RCC_ADCDAC_GetKernelClkFreq();
}

/**
  * @brief  Return the peripheral clock frequency for DAC1 sample and hold.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_DAC1_GetSampleHoldClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetDACSHClockSource(LL_RCC_DAC1SH_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_DAC1SH_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        frequency = LSI_VALUE;
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_DAC1SH_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}
#if defined(LPTIM1)
/**
  * @brief  Return the peripheral clock frequency for LPTIM1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_LPTIM1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_LPTIM1_CLKSOURCE_PCLK3:
      frequency = HAL_RCC_GetPCLK3Freq();
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        frequency = LSI_VALUE;
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_LPTIM1_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}

#endif /* LPTIM1 */
#if defined(XSPI1)
/**
  * @brief  Return the peripheral clock frequency for XSPI.
  * @param  xspix XSPI instance
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_XSPI_GetKernelClkFreq(const XSPI_TypeDef *xspix)
{
  uint32_t frequency = 0;

  switch ((uint32_t)xspix)
  {
    case (uint32_t)XSPI1:
      frequency = HAL_RCC_XSPI1_GetKernelClkFreq();
      break;

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for XSPI.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_XSPI1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetXSPIClockSource(LL_RCC_XSPI1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_XSPI1_CLKSOURCE_HCLK:
      frequency = HAL_RCC_GetHCLKFreq();
      break;

    case LL_RCC_XSPI1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    case LL_RCC_XSPI1_CLKSOURCE_HSIK:
      if (LL_RCC_HSIK_IsReady() != 0U)
      {
        frequency = (HSI_VALUE * 10UL) / RCC_GetDividerValue(LL_RCC_HSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  return frequency;
}

#endif /* XSPI1 */
#if defined(ETH1)
/**
  * @brief  Return the peripheral clock frequency for ETH1 PTP.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_ETH1PTP_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetETH1ClockSource(LL_RCC_ETH1PTP_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_ETH1PTP_CLKSOURCE_HCLK:
      frequency = HAL_RCC_GetHCLKFreq();
      break;

    case LL_RCC_ETH1PTP_CLKSOURCE_PSIS:
      if (LL_RCC_PSIS_IsReady() != 0U)
      {
        frequency = HAL_RCC_GetPSIClockFreq();
      }
      break;

    case LL_RCC_ETH1PTP_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

    default:
      break;
  }

  frequency = frequency / RCC_GET_ETH1PTP_PRESCALER();

  return frequency;
}

/**
  * @brief  Return the peripheral clock frequency for ETH1.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_ETH1_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetETH1ClockSource(LL_RCC_ETH1_CLKSOURCE);

  switch (srcclk)
  {
    case LL_RCC_ETH1_CLKSOURCE_PSIS:
      if (LL_RCC_PSIS_IsReady() != 0U)
      {
        frequency = HAL_RCC_GetPSIClockFreq();
      }
      break;

    case LL_RCC_ETH1_CLKSOURCE_PSIK:
      if (LL_RCC_PSIK_IsReady() != 0U)
      {
        frequency = (HAL_RCC_GetPSIClockFreq() * 10UL) / RCC_GetDividerValue(LL_RCC_PSIK_GetDivider());
      }
      break;

#if defined(HSE_VALUE)
    case LL_RCC_ETH1_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        frequency = HSE_VALUE;
      }
      break;
#endif /* HSE_VALUE */

    default:
      break;
  }

  frequency = frequency / RCC_GET_ETH1_PRESCALER();

