MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rcc.c
  return frequency;
}
#endif /* ETH1 */


/**
  * @brief  Return the peripheral clock frequency for RTC.
  * @retval uint32_t Frequency in Hz
  * @retval 0        Frequency not calculated (Oscillator not ready)
  */
uint32_t HAL_RCC_RTC_GetKernelClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetRTCClockSource();
  uint32_t rtccr_temp = LL_RCC_READ_REG(RTCCR);

  switch (srcclk)
  {
    case LL_RCC_RTC_CLKSOURCE_LSI:
      if (STM32_IS_BIT_SET(rtccr_temp, RCC_RTCCR_LSIRDY))
      {
        frequency = LSI_VALUE;
      }
      break;

#if defined(LSE_VALUE)
    case LL_RCC_RTC_CLKSOURCE_LSE:
      if (STM32_IS_BIT_SET(rtccr_temp, RCC_RTCCR_LSERDY))
      {
        frequency = LSE_VALUE;
      }
      break;
#endif /* LSE_VALUE */

#if defined(HSE_VALUE)
    case LL_RCC_RTC_CLKSOURCE_HSE_DIV:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        uint32_t Prescaler = LL_RCC_GetRTC_HSEPrescaler();
        if (Prescaler >= 0x2U)
        {
          frequency = HSE_VALUE / Prescaler;
        }
        else
        {
          frequency = 0U;
        }
      }
      break;
#endif /* HSE_VALUE */

    default:
      break;
  }

  return frequency;
}

/**
  * @brief  Get the Systick external clock frequency.
  * @retval uint32_t Frequency in Hz
  */
uint32_t HAL_RCC_GetSysTickExternalClkFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t srcclk = LL_RCC_GetSystickClockSource();

  switch (srcclk)
  {
    case LL_RCC_SYSTICK_CLKSOURCE_HCLKDIV8:
      frequency = (HAL_RCC_GetHCLKFreq() >> 3U);
      break;

    case LL_RCC_SYSTICK_CLKSOURCE_LSI:
      frequency = LSI_VALUE;
      break;

#if defined(LSE_VALUE)
    case LL_RCC_SYSTICK_CLKSOURCE_LSE:
      frequency = LSE_VALUE;
      break;
#endif /* LSE_VALUE */

    default:
      break;
  }

  return frequency;
}
/**
  * @}
  */ /* RCC_Exported_Functions_Group4 */

/** @addtogroup RCC_Exported_Functions_Group5 RCC privileged access levels attributes management
  * This subsection provides a set of functions:
  * @{
  */
/**
  * @brief  Set the privileged access level attribute for item(s).
  * @param  item This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_RCC_PRIV_ITEM_ALL
  * @param  priv_attr This parameter can be one of the following values:
  *         @arg @ref HAL_RCC_PRIV
  *         @arg @ref HAL_RCC_NPRIV
  * @retval HAL_OK      Privileged attribute has been set successfully
  * @retval HAL_ERROR   Non-privileged write to a privileged-only register
  */
hal_status_t HAL_RCC_SetPrivAttr(uint32_t item, hal_rcc_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_RCC_PRIV_ITEM(item));
  ASSERT_DBG_PARAM(IS_RCC_PRIV_ATTR(priv_attr));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_RCC_SetPrivAttr(item, (uint32_t) priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get the privileged access level attribute of an item.
  * @param  item This parameter can be one of the following values:
  *         @arg @ref HAL_RCC_PRIV_ITEM_ALL
  * @retval The returned value can be one of the following values:
  *         @arg @ref HAL_RCC_PRIV
  *         @arg @ref HAL_RCC_NPRIV
  */
hal_rcc_priv_attr_t HAL_RCC_GetPrivAttr(uint32_t item)
{
  ASSERT_DBG_PARAM(IS_RCC_PRIV_ITEM(item));

  return ((hal_rcc_priv_attr_t)LL_RCC_GetPrivAttr(item));
}

/**
  * @}
  */ /* RCC_Exported_Functions_Group5 */

/**
  * @}
  */ /* RCC_Exported_Functions */
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup RCC_Private_Functions
  * @{
  */
/** @brief  Wait for clock timeout.
  * @param  p_timeout_cb Callback on the timeout function
  * @param  timeout      Timeout value
  * @param  status       Status to be checked
  * @retval HAL_OK       Not timeout detected
  * @retval HAL_ERROR    Timeout detected during clock activation or deactivation
  */
static hal_status_t RCC_WaitForTimeout(const rcc_cb_timeout_t p_timeout_cb, uint32_t timeout, uint32_t status)
{
  uint32_t tickstart;
  hal_status_t hal_status = HAL_OK;
  tickstart = HAL_GetTick();

  while (p_timeout_cb() != status)
  {
    if ((HAL_GetTick() - tickstart) > timeout)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (p_timeout_cb() != status)
      {
        hal_status = HAL_ERROR;
        break;
      }
    }
  }

  return hal_status;
}

/** @brief  Get the value for a divider factor 10.
  * @param  divider field
  * @retval divider value factor 10
  */
static uint32_t RCC_GetDividerValue(uint32_t divider)
{
  uint32_t value;

  if ((divider == LL_RCC_PSIK_DIV_1) || (divider == LL_RCC_HSIK_DIV_1))
  {
    value = 10UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_1_5) || (divider == LL_RCC_HSIK_DIV_1_5))
  {
    value = 15UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_2) || (divider == LL_RCC_HSIK_DIV_2))
  {
    value = 20UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_2_5) || (divider == LL_RCC_HSIK_DIV_2_5))
  {
    value = 25UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_3) || (divider == LL_RCC_HSIK_DIV_3))
  {
    value = 30UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_3_5) || (divider == LL_RCC_HSIK_DIV_3_5))
  {
    value = 35UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_4) || (divider == LL_RCC_HSIK_DIV_4))
  {
    value = 40UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_4_5) || (divider == LL_RCC_HSIK_DIV_4_5))
  {
    value = 45UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_5) || (divider == LL_RCC_HSIK_DIV_5))
  {
    value = 50UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_5_5) || (divider == LL_RCC_HSIK_DIV_5_5))
  {
    value = 55UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_6) || (divider == LL_RCC_HSIK_DIV_6))
  {
    value = 60UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_6_5) || (divider == LL_RCC_HSIK_DIV_6_5))
  {
    value = 65UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_7) || (divider == LL_RCC_HSIK_DIV_7))
  {
    value = 70UL;
  }
  else if ((divider == LL_RCC_PSIK_DIV_7_5) || (divider == LL_RCC_HSIK_DIV_7_5))
  {
    value = 75UL;
  }
  else
  {
    value = 80UL;
  }
  return value;
}

/**
  * @}
  */ /* RCC_Private_Functions */

#endif /* USE_HAL_RCC_MODULE */
#endif /* RCC */
/**
  * @}
  */

/**
  * @}
  */
